;******************************************************************************
;* TI ARM C/C++ Codegen                                      Unix v16.9.6.LTS *
;* Date/Time created: Thu Dec 28 17:45:45 2017                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --embedded_constants=on --endian=little --float_support=vfplib --hll_source=on --object_format=elf --quiet --section_sizes=on --silicon_version=7M4 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/slnetif/slnetifwifi.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen Unix v16.9.6.LTS Copyright (c) 1996-2017 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/slnetif/ccs/Release")

$C$DW$1	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$1, DW_AT_name("memset")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("memset")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv7/tools/compiler/ti-cgt-arm_16.9.6.LTS/include/string.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x71)
	.dwattr $C$DW$1, DW_AT_decl_column(0x16)

	.dwattr $C$DW$T$444, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netcfg.h")
	.dwattr $C$DW$T$444, DW_AT_decl_line(0x99)
	.dwattr $C$DW$T$444, DW_AT_decl_column(0x02)


$C$DW$T$445	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$445, DW_AT_byte_size(0x01)
$C$DW$551	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$551, DW_AT_name("SL_NETCFG_DHCP_OPT_DISABLE_LLA")
	.dwattr $C$DW$551, DW_AT_const_value(0x02)
	.dwattr $C$DW$551, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netcfg.h")
	.dwattr $C$DW$551, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$551, DW_AT_decl_column(0x05)

$C$DW$552	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$552, DW_AT_name("SL_NETCFG_DHCP_OPT_RELEASE_IP_BEFORE_DISCONNECT")
	.dwattr $C$DW$552, DW_AT_const_value(0x04)
	.dwattr $C$DW$552, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netcfg.h")
	.dwattr $C$DW$552, DW_AT_decl_line(0x9f)
	.dwattr $C$DW$552, DW_AT_decl_column(0x05)

$C$DW$553	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$553, DW_AT_name("MAX_SL_NETCFG_DHCP_OPT")
	.dwattr $C$DW$553, DW_AT_const_value(0xff)
	.dwattr $C$DW$553, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netcfg.h")
	.dwattr $C$DW$553, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$553, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$445, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netcfg.h")
	.dwattr $C$DW$T$445, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$T$445, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$445

$C$DW$T$446	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$446, DW_AT_name("SlNetCfgDhcpOption_e")
	.dwattr $C$DW$T$446, DW_AT_type(*$C$DW$T$445)
	.dwattr $C$DW$T$446, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$446, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netcfg.h")
	.dwattr $C$DW$T$446, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$T$446, DW_AT_decl_column(0x03)


$C$DW$T$447	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$447, DW_AT_byte_size(0x01)
$C$DW$554	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$554, DW_AT_name("SL_EVENT_HDL_FATAL_ERROR")
	.dwattr $C$DW$554, DW_AT_const_value(0x00)
	.dwattr $C$DW$554, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/eventreg.h")
	.dwattr $C$DW$554, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$554, DW_AT_decl_column(0x05)

$C$DW$555	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$555, DW_AT_name("SL_EVENT_HDL_DEVICE_GENERAL")
	.dwattr $C$DW$555, DW_AT_const_value(0x01)
	.dwattr $C$DW$555, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/eventreg.h")
	.dwattr $C$DW$555, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$555, DW_AT_decl_column(0x05)

$C$DW$556	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$556, DW_AT_name("SL_EVENT_HDL_WLAN")
	.dwattr $C$DW$556, DW_AT_const_value(0x02)
	.dwattr $C$DW$556, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/eventreg.h")
	.dwattr $C$DW$556, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$556, DW_AT_decl_column(0x05)

$C$DW$557	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$557, DW_AT_name("SL_EVENT_HDL_NETAPP")
	.dwattr $C$DW$557, DW_AT_const_value(0x03)
	.dwattr $C$DW$557, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/eventreg.h")
	.dwattr $C$DW$557, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$557, DW_AT_decl_column(0x05)

$C$DW$558	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$558, DW_AT_name("SL_EVENT_HDL_SOCKET")
	.dwattr $C$DW$558, DW_AT_const_value(0x04)
	.dwattr $C$DW$558, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/eventreg.h")
	.dwattr $C$DW$558, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$558, DW_AT_decl_column(0x05)

$C$DW$559	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$559, DW_AT_name("SL_EVENT_HDL_HTTP_SERVER")
	.dwattr $C$DW$559, DW_AT_const_value(0x05)
	.dwattr $C$DW$559, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/eventreg.h")
	.dwattr $C$DW$559, DW_AT_decl_line(0x40)
	.dwattr $C$DW$559, DW_AT_decl_column(0x05)

$C$DW$560	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$560, DW_AT_name("SL_EVENT_HDL_NETAPP_REQUEST")
	.dwattr $C$DW$560, DW_AT_const_value(0x06)
	.dwattr $C$DW$560, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/eventreg.h")
	.dwattr $C$DW$560, DW_AT_decl_line(0x41)
	.dwattr $C$DW$560, DW_AT_decl_column(0x05)

$C$DW$561	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$561, DW_AT_name("SL_EVENT_HDL_MEM_FREE")
	.dwattr $C$DW$561, DW_AT_const_value(0x07)
	.dwattr $C$DW$561, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/eventreg.h")
	.dwattr $C$DW$561, DW_AT_decl_line(0x42)
	.dwattr $C$DW$561, DW_AT_decl_column(0x05)

$C$DW$562	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$562, DW_AT_name("SL_EVENT_HDL_SOCKET_TRIGGER")
	.dwattr $C$DW$562, DW_AT_const_value(0x08)
	.dwattr $C$DW$562, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/eventreg.h")
	.dwattr $C$DW$562, DW_AT_decl_line(0x43)
	.dwattr $C$DW$562, DW_AT_decl_column(0x05)

$C$DW$563	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$563, DW_AT_name("SL_NUM_OF_EVENT_TYPES")
	.dwattr $C$DW$563, DW_AT_const_value(0x09)
	.dwattr $C$DW$563, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/eventreg.h")
	.dwattr $C$DW$563, DW_AT_decl_line(0x44)
	.dwattr $C$DW$563, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$447, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/eventreg.h")
	.dwattr $C$DW$T$447, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$T$447, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$447

$C$DW$T$448	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$448, DW_AT_name("SlEventHandler_e")
	.dwattr $C$DW$T$448, DW_AT_type(*$C$DW$T$447)
	.dwattr $C$DW$T$448, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$448, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/eventreg.h")
	.dwattr $C$DW$T$448, DW_AT_decl_line(0x45)
	.dwattr $C$DW$T$448, DW_AT_decl_column(0x02)


$C$DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x28)
$C$DW$564	.dwtag  DW_TAG_member
	.dwattr $C$DW$564, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$564, DW_AT_name("SsidLen")
	.dwattr $C$DW$564, DW_AT_TI_symbol_name("SsidLen")
	.dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$564, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$564, DW_AT_decl_line(0x1fd)
	.dwattr $C$DW$564, DW_AT_decl_column(0x0d)

$C$DW$565	.dwtag  DW_TAG_member
	.dwattr $C$DW$565, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$565, DW_AT_name("SsidName")
	.dwattr $C$DW$565, DW_AT_TI_symbol_name("SsidName")
	.dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$565, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$565, DW_AT_decl_line(0x1fe)
	.dwattr $C$DW$565, DW_AT_decl_column(0x0d)

$C$DW$566	.dwtag  DW_TAG_member
	.dwattr $C$DW$566, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$566, DW_AT_name("Bssid")
	.dwattr $C$DW$566, DW_AT_TI_symbol_name("Bssid")
	.dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$566, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$566, DW_AT_decl_line(0x1ff)
	.dwattr $C$DW$566, DW_AT_decl_column(0x0d)

$C$DW$567	.dwtag  DW_TAG_member
	.dwattr $C$DW$567, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$567, DW_AT_name("Padding")
	.dwattr $C$DW$567, DW_AT_TI_symbol_name("Padding")
	.dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
	.dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$567, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$567, DW_AT_decl_line(0x200)
	.dwattr $C$DW$567, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$21, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$21, DW_AT_decl_line(0x1fc)
	.dwattr $C$DW$T$21, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$21

$C$DW$T$197	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$197, DW_AT_name("SlWlanEventConnect_t")
	.dwattr $C$DW$T$197, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$197, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$197, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$197, DW_AT_decl_line(0x201)
	.dwattr $C$DW$T$197, DW_AT_decl_column(0x03)


$C$DW$T$23	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x4c)
$C$DW$568	.dwtag  DW_TAG_member
	.dwattr $C$DW$568, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$568, DW_AT_name("SsidLen")
	.dwattr $C$DW$568, DW_AT_TI_symbol_name("SsidLen")
	.dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$568, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$568, DW_AT_decl_line(0x214)
	.dwattr $C$DW$568, DW_AT_decl_column(0x0d)

$C$DW$569	.dwtag  DW_TAG_member
	.dwattr $C$DW$569, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$569, DW_AT_name("SsidName")
	.dwattr $C$DW$569, DW_AT_TI_symbol_name("SsidName")
	.dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$569, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$569, DW_AT_decl_line(0x215)
	.dwattr $C$DW$569, DW_AT_decl_column(0x0d)

$C$DW$570	.dwtag  DW_TAG_member
	.dwattr $C$DW$570, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$570, DW_AT_name("Bssid")
	.dwattr $C$DW$570, DW_AT_TI_symbol_name("Bssid")
	.dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$570, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$570, DW_AT_decl_line(0x216)
	.dwattr $C$DW$570, DW_AT_decl_column(0x0d)

$C$DW$571	.dwtag  DW_TAG_member
	.dwattr $C$DW$571, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$571, DW_AT_name("Reserved")
	.dwattr $C$DW$571, DW_AT_TI_symbol_name("Reserved")
	.dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
	.dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$571, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$571, DW_AT_decl_line(0x217)
	.dwattr $C$DW$571, DW_AT_decl_column(0x0d)

$C$DW$572	.dwtag  DW_TAG_member
	.dwattr $C$DW$572, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$572, DW_AT_name("GoDeviceNameLen")
	.dwattr $C$DW$572, DW_AT_TI_symbol_name("GoDeviceNameLen")
	.dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$572, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$572, DW_AT_decl_line(0x218)
	.dwattr $C$DW$572, DW_AT_decl_column(0x0d)

$C$DW$573	.dwtag  DW_TAG_member
	.dwattr $C$DW$573, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$573, DW_AT_name("GoDeviceName")
	.dwattr $C$DW$573, DW_AT_TI_symbol_name("GoDeviceName")
	.dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$573, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$573, DW_AT_decl_line(0x219)
	.dwattr $C$DW$573, DW_AT_decl_column(0x0d)

$C$DW$574	.dwtag  DW_TAG_member
	.dwattr $C$DW$574, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$574, DW_AT_name("Padding")
	.dwattr $C$DW$574, DW_AT_TI_symbol_name("Padding")
	.dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
	.dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$574, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$574, DW_AT_decl_line(0x21a)
	.dwattr $C$DW$574, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$23, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$23, DW_AT_decl_line(0x213)
	.dwattr $C$DW$T$23, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$23

$C$DW$T$198	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$198, DW_AT_name("SlWlanEventP2PConnect_t")
	.dwattr $C$DW$T$198, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$T$198, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$198, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$198, DW_AT_decl_line(0x21b)
	.dwattr $C$DW$T$198, DW_AT_decl_column(0x03)


$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x50)
$C$DW$575	.dwtag  DW_TAG_member
	.dwattr $C$DW$575, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$575, DW_AT_name("Mode")
	.dwattr $C$DW$575, DW_AT_TI_symbol_name("Mode")
	.dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$575, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$575, DW_AT_decl_line(0x2b3)
	.dwattr $C$DW$575, DW_AT_decl_column(0x09)

$C$DW$576	.dwtag  DW_TAG_member
	.dwattr $C$DW$576, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$576, DW_AT_name("ConnStatus")
	.dwattr $C$DW$576, DW_AT_TI_symbol_name("ConnStatus")
	.dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$576, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$576, DW_AT_decl_line(0x2b4)
	.dwattr $C$DW$576, DW_AT_decl_column(0x09)

$C$DW$577	.dwtag  DW_TAG_member
	.dwattr $C$DW$577, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$577, DW_AT_name("SecType")
	.dwattr $C$DW$577, DW_AT_TI_symbol_name("SecType")
	.dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$577, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$577, DW_AT_decl_line(0x2b5)
	.dwattr $C$DW$577, DW_AT_decl_column(0x09)

$C$DW$578	.dwtag  DW_TAG_member
	.dwattr $C$DW$578, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$578, DW_AT_name("Reserved")
	.dwattr $C$DW$578, DW_AT_TI_symbol_name("Reserved")
	.dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$578, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$578, DW_AT_decl_line(0x2b6)
	.dwattr $C$DW$578, DW_AT_decl_column(0x09)

$C$DW$579	.dwtag  DW_TAG_member
	.dwattr $C$DW$579, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$579, DW_AT_name("ConnectionInfo")
	.dwattr $C$DW$579, DW_AT_TI_symbol_name("ConnectionInfo")
	.dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$579, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$579, DW_AT_decl_line(0x2b7)
	.dwattr $C$DW$579, DW_AT_decl_column(0x1c)

	.dwattr $C$DW$T$25, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$25, DW_AT_decl_line(0x2b2)
	.dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$25

$C$DW$T$449	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$449, DW_AT_name("SlWlanConnStatusParam_t")
	.dwattr $C$DW$T$449, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$449, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$449, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$449, DW_AT_decl_line(0x2b8)
	.dwattr $C$DW$T$449, DW_AT_decl_column(0x02)


$C$DW$T$29	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
$C$DW$580	.dwtag  DW_TAG_member
	.dwattr $C$DW$580, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$580, DW_AT_name("pEntry")
	.dwattr $C$DW$580, DW_AT_TI_symbol_name("pEntry")
	.dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$580, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/porting/cc_pal.h")
	.dwattr $C$DW$580, DW_AT_decl_line(0x64)
	.dwattr $C$DW$580, DW_AT_decl_column(0x13)

$C$DW$581	.dwtag  DW_TAG_member
	.dwattr $C$DW$581, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$581, DW_AT_name("pValue")
	.dwattr $C$DW$581, DW_AT_TI_symbol_name("pValue")
	.dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$581, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/porting/cc_pal.h")
	.dwattr $C$DW$581, DW_AT_decl_line(0x65)
	.dwattr $C$DW$581, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$29, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/porting/cc_pal.h")
	.dwattr $C$DW$T$29, DW_AT_decl_line(0x63)
	.dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$29

$C$DW$T$451	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$451, DW_AT_name("tSimpleLinkSpawnMsg")
	.dwattr $C$DW$T$451, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$T$451, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$451, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/porting/cc_pal.h")
	.dwattr $C$DW$T$451, DW_AT_decl_line(0x66)
	.dwattr $C$DW$T$451, DW_AT_decl_column(0x02)


$C$DW$T$31	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x24)
$C$DW$582	.dwtag  DW_TAG_member
	.dwattr $C$DW$582, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$582, DW_AT_name("Flags")
	.dwattr $C$DW$582, DW_AT_TI_symbol_name("Flags")
	.dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$582, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$582, DW_AT_decl_line(0x90)
	.dwattr $C$DW$582, DW_AT_decl_column(0x0b)

$C$DW$583	.dwtag  DW_TAG_member
	.dwattr $C$DW$583, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$583, DW_AT_name("Len")
	.dwattr $C$DW$583, DW_AT_TI_symbol_name("Len")
	.dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$583, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$583, DW_AT_decl_line(0x91)
	.dwattr $C$DW$583, DW_AT_decl_column(0x0b)

$C$DW$584	.dwtag  DW_TAG_member
	.dwattr $C$DW$584, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$584, DW_AT_name("MaxSize")
	.dwattr $C$DW$584, DW_AT_TI_symbol_name("MaxSize")
	.dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$584, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$584, DW_AT_decl_line(0x92)
	.dwattr $C$DW$584, DW_AT_decl_column(0x0b)

$C$DW$585	.dwtag  DW_TAG_member
	.dwattr $C$DW$585, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$585, DW_AT_name("Token")
	.dwattr $C$DW$585, DW_AT_TI_symbol_name("Token")
	.dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$585, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$585, DW_AT_decl_line(0x93)
	.dwattr $C$DW$585, DW_AT_decl_column(0x0b)

$C$DW$586	.dwtag  DW_TAG_member
	.dwattr $C$DW$586, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$586, DW_AT_name("StorageSize")
	.dwattr $C$DW$586, DW_AT_TI_symbol_name("StorageSize")
	.dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$586, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$586, DW_AT_decl_line(0x94)
	.dwattr $C$DW$586, DW_AT_decl_column(0x0b)

$C$DW$587	.dwtag  DW_TAG_member
	.dwattr $C$DW$587, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$587, DW_AT_name("WriteCounter")
	.dwattr $C$DW$587, DW_AT_TI_symbol_name("WriteCounter")
	.dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$587, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$587, DW_AT_decl_line(0x95)
	.dwattr $C$DW$587, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$31, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$31, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$T$31, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$31

$C$DW$T$452	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$452, DW_AT_name("SlFsFileInfo_t")
	.dwattr $C$DW$T$452, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$452, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$452, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$452, DW_AT_decl_line(0x96)
	.dwattr $C$DW$T$452, DW_AT_decl_column(0x02)


$C$DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$32, DW_AT_byte_size(0x10)
$C$DW$588	.dwtag  DW_TAG_member
	.dwattr $C$DW$588, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$588, DW_AT_name("Key")
	.dwattr $C$DW$588, DW_AT_TI_symbol_name("Key")
	.dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$588, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$588, DW_AT_decl_line(0xb1)
	.dwattr $C$DW$588, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$32, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$32, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$32

$C$DW$T$453	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$453, DW_AT_name("SlFsKey_t")
	.dwattr $C$DW$T$453, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$T$453, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$453, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$453, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$T$453, DW_AT_decl_column(0x02)


$C$DW$T$33	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
$C$DW$589	.dwtag  DW_TAG_member
	.dwattr $C$DW$589, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$589, DW_AT_name("Index")
	.dwattr $C$DW$589, DW_AT_TI_symbol_name("Index")
	.dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$589, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$589, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$589, DW_AT_decl_column(0x09)

	.dwattr $C$DW$T$33, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$33, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$33

$C$DW$T$207	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$207, DW_AT_name("SlFsFileNameIndex_t")
	.dwattr $C$DW$T$207, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$207, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$207, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$207, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$207, DW_AT_decl_column(0x02)


$C$DW$T$34	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$34, DW_AT_byte_size(0x04)
$C$DW$590	.dwtag  DW_TAG_member
	.dwattr $C$DW$590, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$590, DW_AT_name("Operation")
	.dwattr $C$DW$590, DW_AT_TI_symbol_name("Operation")
	.dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$590, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$590, DW_AT_decl_line(0xca)
	.dwattr $C$DW$590, DW_AT_decl_column(0x08)

	.dwattr $C$DW$T$34, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$34, DW_AT_decl_line(0xc9)
	.dwattr $C$DW$T$34, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$34

$C$DW$T$454	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$454, DW_AT_name("SlFsRetToFactoryCommand_t")
	.dwattr $C$DW$T$454, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$T$454, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$454, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$454, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$T$454, DW_AT_decl_column(0x02)


$C$DW$T$35	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$35, DW_AT_byte_size(0x04)
$C$DW$591	.dwtag  DW_TAG_member
	.dwattr $C$DW$591, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$591, DW_AT_name("IncludeFilters")
	.dwattr $C$DW$591, DW_AT_TI_symbol_name("IncludeFilters")
	.dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$591, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$591, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$591, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$35, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$35, DW_AT_decl_line(0xd0)
	.dwattr $C$DW$T$35, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$35

$C$DW$T$455	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$455, DW_AT_name("SlFsControl_t")
	.dwattr $C$DW$T$455, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$T$455, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$455, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$455, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$455, DW_AT_decl_column(0x02)


$C$DW$T$37	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$37, DW_AT_byte_size(0x10)
$C$DW$592	.dwtag  DW_TAG_member
	.dwattr $C$DW$592, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$592, DW_AT_name("DeviceBlockSize")
	.dwattr $C$DW$592, DW_AT_TI_symbol_name("DeviceBlockSize")
	.dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$592, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$592, DW_AT_decl_line(0xd7)
	.dwattr $C$DW$592, DW_AT_decl_column(0x08)

$C$DW$593	.dwtag  DW_TAG_member
	.dwattr $C$DW$593, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$593, DW_AT_name("DeviceBlocksCapacity")
	.dwattr $C$DW$593, DW_AT_TI_symbol_name("DeviceBlocksCapacity")
	.dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$593, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$593, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$593, DW_AT_decl_column(0x08)

$C$DW$594	.dwtag  DW_TAG_member
	.dwattr $C$DW$594, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$594, DW_AT_name("NumOfAllocatedBlocks")
	.dwattr $C$DW$594, DW_AT_TI_symbol_name("NumOfAllocatedBlocks")
	.dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$594, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$594, DW_AT_decl_line(0xd9)
	.dwattr $C$DW$594, DW_AT_decl_column(0x08)

$C$DW$595	.dwtag  DW_TAG_member
	.dwattr $C$DW$595, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$595, DW_AT_name("NumOfReservedBlocks")
	.dwattr $C$DW$595, DW_AT_TI_symbol_name("NumOfReservedBlocks")
	.dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$595, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$595, DW_AT_decl_line(0xda)
	.dwattr $C$DW$595, DW_AT_decl_column(0x08)

$C$DW$596	.dwtag  DW_TAG_member
	.dwattr $C$DW$596, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$596, DW_AT_name("NumOfReservedBlocksForSystemfiles")
	.dwattr $C$DW$596, DW_AT_TI_symbol_name("NumOfReservedBlocksForSystemfiles")
	.dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$596, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$596, DW_AT_decl_line(0xdb)
	.dwattr $C$DW$596, DW_AT_decl_column(0x08)

$C$DW$597	.dwtag  DW_TAG_member
	.dwattr $C$DW$597, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$597, DW_AT_name("LargestAllocatedGapInBlocks")
	.dwattr $C$DW$597, DW_AT_TI_symbol_name("LargestAllocatedGapInBlocks")
	.dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$597, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$597, DW_AT_decl_line(0xdc)
	.dwattr $C$DW$597, DW_AT_decl_column(0x08)

$C$DW$598	.dwtag  DW_TAG_member
	.dwattr $C$DW$598, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$598, DW_AT_name("NumOfAvailableBlocksForUserFiles")
	.dwattr $C$DW$598, DW_AT_TI_symbol_name("NumOfAvailableBlocksForUserFiles")
	.dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$598, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$598, DW_AT_decl_line(0xdd)
	.dwattr $C$DW$598, DW_AT_decl_column(0x08)

$C$DW$599	.dwtag  DW_TAG_member
	.dwattr $C$DW$599, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$599, DW_AT_name("Padding")
	.dwattr $C$DW$599, DW_AT_TI_symbol_name("Padding")
	.dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$599, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$599, DW_AT_decl_line(0xde)
	.dwattr $C$DW$599, DW_AT_decl_column(0x08)

	.dwattr $C$DW$T$37, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$37, DW_AT_decl_line(0xd6)
	.dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$37

$C$DW$T$39	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$39, DW_AT_name("SlFsControlDeviceUsage_t")
	.dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$39, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$39, DW_AT_decl_line(0xdf)
	.dwattr $C$DW$T$39, DW_AT_decl_column(0x03)


$C$DW$T$38	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$38, DW_AT_byte_size(0x14)
$C$DW$600	.dwtag  DW_TAG_member
	.dwattr $C$DW$600, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$600, DW_AT_name("MaxFsFiles")
	.dwattr $C$DW$600, DW_AT_TI_symbol_name("MaxFsFiles")
	.dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$600, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$600, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$600, DW_AT_decl_column(0x08)

$C$DW$601	.dwtag  DW_TAG_member
	.dwattr $C$DW$601, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$601, DW_AT_name("IsDevlopmentFormatType")
	.dwattr $C$DW$601, DW_AT_TI_symbol_name("IsDevlopmentFormatType")
	.dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$601, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$601, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$601, DW_AT_decl_column(0x08)

$C$DW$602	.dwtag  DW_TAG_member
	.dwattr $C$DW$602, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$602, DW_AT_name("Bundlestate")
	.dwattr $C$DW$602, DW_AT_TI_symbol_name("Bundlestate")
	.dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$602, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$602, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$602, DW_AT_decl_column(0x08)

$C$DW$603	.dwtag  DW_TAG_member
	.dwattr $C$DW$603, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$603, DW_AT_name("Reserved")
	.dwattr $C$DW$603, DW_AT_TI_symbol_name("Reserved")
	.dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$603, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$603, DW_AT_decl_line(0xe6)
	.dwattr $C$DW$603, DW_AT_decl_column(0x08)

$C$DW$604	.dwtag  DW_TAG_member
	.dwattr $C$DW$604, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$604, DW_AT_name("MaxFsFilesReservedForSysFiles")
	.dwattr $C$DW$604, DW_AT_TI_symbol_name("MaxFsFilesReservedForSysFiles")
	.dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$604, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$604, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$604, DW_AT_decl_column(0x08)

$C$DW$605	.dwtag  DW_TAG_member
	.dwattr $C$DW$605, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$605, DW_AT_name("ActualNumOfUserFiles")
	.dwattr $C$DW$605, DW_AT_TI_symbol_name("ActualNumOfUserFiles")
	.dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$605, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$605, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$605, DW_AT_decl_column(0x08)

$C$DW$606	.dwtag  DW_TAG_member
	.dwattr $C$DW$606, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$606, DW_AT_name("ActualNumOfSysFiles")
	.dwattr $C$DW$606, DW_AT_TI_symbol_name("ActualNumOfSysFiles")
	.dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$606, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$606, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$606, DW_AT_decl_column(0x08)

$C$DW$607	.dwtag  DW_TAG_member
	.dwattr $C$DW$607, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$607, DW_AT_name("Padding")
	.dwattr $C$DW$607, DW_AT_TI_symbol_name("Padding")
	.dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$607, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$607, DW_AT_decl_line(0xea)
	.dwattr $C$DW$607, DW_AT_decl_column(0x08)

$C$DW$608	.dwtag  DW_TAG_member
	.dwattr $C$DW$608, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$608, DW_AT_name("NumOfAlerts")
	.dwattr $C$DW$608, DW_AT_TI_symbol_name("NumOfAlerts")
	.dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$608, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$608, DW_AT_decl_line(0xeb)
	.dwattr $C$DW$608, DW_AT_decl_column(0x08)

$C$DW$609	.dwtag  DW_TAG_member
	.dwattr $C$DW$609, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$609, DW_AT_name("NumOfAlertsThreshold")
	.dwattr $C$DW$609, DW_AT_TI_symbol_name("NumOfAlertsThreshold")
	.dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$609, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$609, DW_AT_decl_line(0xec)
	.dwattr $C$DW$609, DW_AT_decl_column(0x08)

$C$DW$610	.dwtag  DW_TAG_member
	.dwattr $C$DW$610, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$610, DW_AT_name("FATWriteCounter")
	.dwattr $C$DW$610, DW_AT_TI_symbol_name("FATWriteCounter")
	.dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$610, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$610, DW_AT_decl_line(0xed)
	.dwattr $C$DW$610, DW_AT_decl_column(0x08)

$C$DW$611	.dwtag  DW_TAG_member
	.dwattr $C$DW$611, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$611, DW_AT_name("Padding2")
	.dwattr $C$DW$611, DW_AT_TI_symbol_name("Padding2")
	.dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$611, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$611, DW_AT_decl_line(0xee)
	.dwattr $C$DW$611, DW_AT_decl_column(0x08)

	.dwattr $C$DW$T$38, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$38, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$T$38, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$38

$C$DW$T$40	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$40, DW_AT_name("SlFsControlFilesUsage_t")
	.dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$40, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$40, DW_AT_decl_line(0xef)
	.dwattr $C$DW$T$40, DW_AT_decl_column(0x02)


$C$DW$T$41	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$41, DW_AT_byte_size(0x24)
$C$DW$612	.dwtag  DW_TAG_member
	.dwattr $C$DW$612, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$612, DW_AT_name("DeviceUsage")
	.dwattr $C$DW$612, DW_AT_TI_symbol_name("DeviceUsage")
	.dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$612, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$612, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$612, DW_AT_decl_column(0x1e)

$C$DW$613	.dwtag  DW_TAG_member
	.dwattr $C$DW$613, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$613, DW_AT_name("FilesUsage")
	.dwattr $C$DW$613, DW_AT_TI_symbol_name("FilesUsage")
	.dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$613, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$613, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$613, DW_AT_decl_column(0x1e)

	.dwattr $C$DW$T$41, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$41, DW_AT_decl_line(0xf3)
	.dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$41

$C$DW$T$456	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$456, DW_AT_name("SlFsControlGetStorageInfoResponse_t")
	.dwattr $C$DW$T$456, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$T$456, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$456, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$456, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$T$456, DW_AT_decl_column(0x03)


$C$DW$T$42	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$42, DW_AT_byte_size(0x0c)
$C$DW$614	.dwtag  DW_TAG_member
	.dwattr $C$DW$614, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$614, DW_AT_name("IncludeFilters")
	.dwattr $C$DW$614, DW_AT_TI_symbol_name("IncludeFilters")
	.dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$614, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$614, DW_AT_decl_line(0xfa)
	.dwattr $C$DW$614, DW_AT_decl_column(0x0b)

$C$DW$615	.dwtag  DW_TAG_member
	.dwattr $C$DW$615, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$615, DW_AT_name("OpenedForWriteCnt")
	.dwattr $C$DW$615, DW_AT_TI_symbol_name("OpenedForWriteCnt")
	.dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$615, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$615, DW_AT_decl_line(0xfb)
	.dwattr $C$DW$615, DW_AT_decl_column(0x0b)

$C$DW$616	.dwtag  DW_TAG_member
	.dwattr $C$DW$616, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$616, DW_AT_name("OpeneForReadCnt")
	.dwattr $C$DW$616, DW_AT_TI_symbol_name("OpeneForReadCnt")
	.dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$616, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$616, DW_AT_decl_line(0xfc)
	.dwattr $C$DW$616, DW_AT_decl_column(0x0b)

$C$DW$617	.dwtag  DW_TAG_member
	.dwattr $C$DW$617, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$617, DW_AT_name("ClosedFilesCnt")
	.dwattr $C$DW$617, DW_AT_TI_symbol_name("ClosedFilesCnt")
	.dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$617, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$617, DW_AT_decl_line(0xfd)
	.dwattr $C$DW$617, DW_AT_decl_column(0x0b)

$C$DW$618	.dwtag  DW_TAG_member
	.dwattr $C$DW$618, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$618, DW_AT_name("OpenedForWriteCntWithValidFailSafeImage")
	.dwattr $C$DW$618, DW_AT_TI_symbol_name("OpenedForWriteCntWithValidFailSafeImage")
	.dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$618, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$618, DW_AT_decl_line(0xfe)
	.dwattr $C$DW$618, DW_AT_decl_column(0x0b)

$C$DW$619	.dwtag  DW_TAG_member
	.dwattr $C$DW$619, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$619, DW_AT_name("OpeneForReadCntWithValidFailSafeImage")
	.dwattr $C$DW$619, DW_AT_TI_symbol_name("OpeneForReadCntWithValidFailSafeImage")
	.dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$619, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$619, DW_AT_decl_line(0xff)
	.dwattr $C$DW$619, DW_AT_decl_column(0x0b)

$C$DW$620	.dwtag  DW_TAG_member
	.dwattr $C$DW$620, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$620, DW_AT_name("ClosedFilesCntWithValidFailSafeImage")
	.dwattr $C$DW$620, DW_AT_TI_symbol_name("ClosedFilesCntWithValidFailSafeImage")
	.dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$620, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$620, DW_AT_decl_line(0x100)
	.dwattr $C$DW$620, DW_AT_decl_column(0x0b)

$C$DW$621	.dwtag  DW_TAG_member
	.dwattr $C$DW$621, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$621, DW_AT_name("padding")
	.dwattr $C$DW$621, DW_AT_TI_symbol_name("padding")
	.dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$621, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$621, DW_AT_decl_line(0x101)
	.dwattr $C$DW$621, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$42, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$42, DW_AT_decl_line(0xf9)
	.dwattr $C$DW$T$42, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$42

$C$DW$T$457	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$457, DW_AT_name("SlFsControlGetCountersResponse_t")
	.dwattr $C$DW$T$457, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$T$457, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$457, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$457, DW_AT_decl_line(0x102)
	.dwattr $C$DW$T$457, DW_AT_decl_column(0x03)


$C$DW$T$43	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$43, DW_AT_byte_size(0x0c)
$C$DW$622	.dwtag  DW_TAG_member
	.dwattr $C$DW$622, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$622, DW_AT_name("FileMaxSize")
	.dwattr $C$DW$622, DW_AT_TI_symbol_name("FileMaxSize")
	.dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$622, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$622, DW_AT_decl_line(0x111)
	.dwattr $C$DW$622, DW_AT_decl_column(0x0a)

$C$DW$623	.dwtag  DW_TAG_member
	.dwattr $C$DW$623, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$623, DW_AT_name("Properties")
	.dwattr $C$DW$623, DW_AT_TI_symbol_name("Properties")
	.dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$623, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$623, DW_AT_decl_line(0x112)
	.dwattr $C$DW$623, DW_AT_decl_column(0x0a)

$C$DW$624	.dwtag  DW_TAG_member
	.dwattr $C$DW$624, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$624, DW_AT_name("FileAllocatedBlocks")
	.dwattr $C$DW$624, DW_AT_TI_symbol_name("FileAllocatedBlocks")
	.dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$624, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$624, DW_AT_decl_line(0x113)
	.dwattr $C$DW$624, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$43, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$43, DW_AT_decl_line(0x110)
	.dwattr $C$DW$T$43, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$43

$C$DW$T$458	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$458, DW_AT_name("SlFileAttributes_t")
	.dwattr $C$DW$T$458, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$T$458, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$458, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$458, DW_AT_decl_line(0x114)
	.dwattr $C$DW$T$458, DW_AT_decl_column(0x02)


$C$DW$T$44	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$44, DW_AT_byte_size(0x04)
$C$DW$625	.dwtag  DW_TAG_member
	.dwattr $C$DW$625, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$625, DW_AT_name("KeepaliveEnabled")
	.dwattr $C$DW$625, DW_AT_TI_symbol_name("KeepaliveEnabled")
	.dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$625, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$625, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$625, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$44, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$44, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$44

$C$DW$T$459	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$459, DW_AT_name("SlSockKeepalive_t")
	.dwattr $C$DW$T$459, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$T$459, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$459, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$459, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$T$459, DW_AT_decl_column(0x02)


$C$DW$T$45	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$45, DW_AT_byte_size(0x04)
$C$DW$626	.dwtag  DW_TAG_member
	.dwattr $C$DW$626, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$626, DW_AT_name("ReuseaddrEnabled")
	.dwattr $C$DW$626, DW_AT_TI_symbol_name("ReuseaddrEnabled")
	.dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$626, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$626, DW_AT_decl_line(0xfb)
	.dwattr $C$DW$626, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$45, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$45, DW_AT_decl_line(0xfa)
	.dwattr $C$DW$T$45, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$45

$C$DW$T$460	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$460, DW_AT_name("SlSockReuseaddr_t")
	.dwattr $C$DW$T$460, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$T$460, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$460, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$460, DW_AT_decl_line(0xfc)
	.dwattr $C$DW$T$460, DW_AT_decl_column(0x02)


$C$DW$T$46	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$46, DW_AT_byte_size(0x04)
$C$DW$627	.dwtag  DW_TAG_member
	.dwattr $C$DW$627, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$627, DW_AT_name("RxIpNoBoundaryEnabled")
	.dwattr $C$DW$627, DW_AT_TI_symbol_name("RxIpNoBoundaryEnabled")
	.dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$627, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$627, DW_AT_decl_line(0x100)
	.dwattr $C$DW$627, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$46, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$46, DW_AT_decl_line(0xff)
	.dwattr $C$DW$T$46, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$46

$C$DW$T$461	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$461, DW_AT_name("SlSockRxNoIpBoundary_t")
	.dwattr $C$DW$T$461, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$461, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$461, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$461, DW_AT_decl_line(0x101)
	.dwattr $C$DW$T$461, DW_AT_decl_column(0x03)


$C$DW$T$47	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$47, DW_AT_byte_size(0x04)
$C$DW$628	.dwtag  DW_TAG_member
	.dwattr $C$DW$628, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$628, DW_AT_name("WinSize")
	.dwattr $C$DW$628, DW_AT_TI_symbol_name("WinSize")
	.dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$628, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$628, DW_AT_decl_line(0x105)
	.dwattr $C$DW$628, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$47, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$47, DW_AT_decl_line(0x104)
	.dwattr $C$DW$T$47, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$47

$C$DW$T$462	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$462, DW_AT_name("SlSockWinsize_t")
	.dwattr $C$DW$T$462, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$T$462, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$462, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$462, DW_AT_decl_line(0x106)
	.dwattr $C$DW$T$462, DW_AT_decl_column(0x02)


$C$DW$T$48	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$48, DW_AT_byte_size(0x04)
$C$DW$629	.dwtag  DW_TAG_member
	.dwattr $C$DW$629, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$629, DW_AT_name("NonBlockingEnabled")
	.dwattr $C$DW$629, DW_AT_TI_symbol_name("NonBlockingEnabled")
	.dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$629, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$629, DW_AT_decl_line(0x10a)
	.dwattr $C$DW$629, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$48, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$48, DW_AT_decl_line(0x109)
	.dwattr $C$DW$T$48, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$48

$C$DW$T$463	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$463, DW_AT_name("SlSockNonblocking_t")
	.dwattr $C$DW$T$463, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$T$463, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$463, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$463, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$T$463, DW_AT_decl_column(0x02)


$C$DW$T$50	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$50, DW_AT_byte_size(0x84)
$C$DW$630	.dwtag  DW_TAG_member
	.dwattr $C$DW$630, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$630, DW_AT_name("Sd")
	.dwattr $C$DW$630, DW_AT_TI_symbol_name("Sd")
	.dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$630, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$630, DW_AT_decl_line(0x10f)
	.dwattr $C$DW$630, DW_AT_decl_column(0x0b)

$C$DW$631	.dwtag  DW_TAG_member
	.dwattr $C$DW$631, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$631, DW_AT_name("Type")
	.dwattr $C$DW$631, DW_AT_TI_symbol_name("Type")
	.dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$631, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$631, DW_AT_decl_line(0x110)
	.dwattr $C$DW$631, DW_AT_decl_column(0x0b)

$C$DW$632	.dwtag  DW_TAG_member
	.dwattr $C$DW$632, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$632, DW_AT_name("Val")
	.dwattr $C$DW$632, DW_AT_TI_symbol_name("Val")
	.dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$632, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$632, DW_AT_decl_line(0x111)
	.dwattr $C$DW$632, DW_AT_decl_column(0x0b)

$C$DW$633	.dwtag  DW_TAG_member
	.dwattr $C$DW$633, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$633, DW_AT_name("pExtraInfo")
	.dwattr $C$DW$633, DW_AT_TI_symbol_name("pExtraInfo")
	.dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$633, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$633, DW_AT_decl_line(0x112)
	.dwattr $C$DW$633, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$50, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$50, DW_AT_decl_line(0x10e)
	.dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$50

$C$DW$T$211	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$211, DW_AT_name("SlSocketAsyncEvent_t")
	.dwattr $C$DW$T$211, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$T$211, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$211, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$211, DW_AT_decl_line(0x113)
	.dwattr $C$DW$T$211, DW_AT_decl_column(0x03)


$C$DW$T$51	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$51, DW_AT_byte_size(0x04)
$C$DW$634	.dwtag  DW_TAG_member
	.dwattr $C$DW$634, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$634, DW_AT_name("Status")
	.dwattr $C$DW$634, DW_AT_TI_symbol_name("Status")
	.dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$634, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$634, DW_AT_decl_line(0x117)
	.dwattr $C$DW$634, DW_AT_decl_column(0x10)

$C$DW$635	.dwtag  DW_TAG_member
	.dwattr $C$DW$635, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$635, DW_AT_name("Sd")
	.dwattr $C$DW$635, DW_AT_TI_symbol_name("Sd")
	.dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$635, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$635, DW_AT_decl_line(0x118)
	.dwattr $C$DW$635, DW_AT_decl_column(0x10)

$C$DW$636	.dwtag  DW_TAG_member
	.dwattr $C$DW$636, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$636, DW_AT_name("Padding")
	.dwattr $C$DW$636, DW_AT_TI_symbol_name("Padding")
	.dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$636, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$636, DW_AT_decl_line(0x119)
	.dwattr $C$DW$636, DW_AT_decl_column(0x10)

	.dwattr $C$DW$T$51, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$51, DW_AT_decl_line(0x116)
	.dwattr $C$DW$T$51, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$51

$C$DW$T$210	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$210, DW_AT_name("SlSockTxFailEventData_t")
	.dwattr $C$DW$T$210, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$T$210, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$210, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$210, DW_AT_decl_line(0x11a)
	.dwattr $C$DW$T$210, DW_AT_decl_column(0x03)


$C$DW$T$53	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$53, DW_AT_byte_size(0x88)
$C$DW$637	.dwtag  DW_TAG_member
	.dwattr $C$DW$637, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$637, DW_AT_name("Event")
	.dwattr $C$DW$637, DW_AT_TI_symbol_name("Event")
	.dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$637, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$637, DW_AT_decl_line(0x126)
	.dwattr $C$DW$637, DW_AT_decl_column(0x1c)

$C$DW$638	.dwtag  DW_TAG_member
	.dwattr $C$DW$638, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$638, DW_AT_name("SocketAsyncEvent")
	.dwattr $C$DW$638, DW_AT_TI_symbol_name("SocketAsyncEvent")
	.dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$638, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$638, DW_AT_decl_line(0x127)
	.dwattr $C$DW$638, DW_AT_decl_column(0x1c)

	.dwattr $C$DW$T$53, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$53, DW_AT_decl_line(0x125)
	.dwattr $C$DW$T$53, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$53

$C$DW$T$464	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$464, DW_AT_name("SlSockEvent_t")
	.dwattr $C$DW$T$464, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$T$464, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$464, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$464, DW_AT_decl_line(0x128)
	.dwattr $C$DW$T$464, DW_AT_decl_column(0x03)


$C$DW$T$54	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$54, DW_AT_byte_size(0x08)
$C$DW$639	.dwtag  DW_TAG_member
	.dwattr $C$DW$639, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$639, DW_AT_name("Event")
	.dwattr $C$DW$639, DW_AT_TI_symbol_name("Event")
	.dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$639, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$639, DW_AT_decl_line(0x12c)
	.dwattr $C$DW$639, DW_AT_decl_column(0x11)

$C$DW$640	.dwtag  DW_TAG_member
	.dwattr $C$DW$640, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$640, DW_AT_name("EventData")
	.dwattr $C$DW$640, DW_AT_TI_symbol_name("EventData")
	.dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$640, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$640, DW_AT_decl_line(0x12d)
	.dwattr $C$DW$640, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$54, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$54, DW_AT_decl_line(0x12b)
	.dwattr $C$DW$T$54, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$54

$C$DW$T$465	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$465, DW_AT_name("SlSockTriggerEvent_t")
	.dwattr $C$DW$T$465, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$T$465, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$465, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$465, DW_AT_decl_line(0x12e)
	.dwattr $C$DW$T$465, DW_AT_decl_column(0x03)


$C$DW$T$55	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$55, DW_AT_byte_size(0x04)
$C$DW$641	.dwtag  DW_TAG_member
	.dwattr $C$DW$641, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$641, DW_AT_name("SecureALPN")
	.dwattr $C$DW$641, DW_AT_TI_symbol_name("SecureALPN")
	.dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$641, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$641, DW_AT_decl_line(0x133)
	.dwattr $C$DW$641, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$55, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$55, DW_AT_decl_line(0x132)
	.dwattr $C$DW$T$55, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$55

$C$DW$T$466	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$466, DW_AT_name("SlSockSecureALPN_t")
	.dwattr $C$DW$T$466, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$T$466, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$466, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$466, DW_AT_decl_line(0x134)
	.dwattr $C$DW$T$466, DW_AT_decl_column(0x03)


$C$DW$T$56	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$56, DW_AT_byte_size(0x04)
$C$DW$642	.dwtag  DW_TAG_member
	.dwattr $C$DW$642, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$642, DW_AT_name("SecureMask")
	.dwattr $C$DW$642, DW_AT_TI_symbol_name("SecureMask")
	.dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$642, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$642, DW_AT_decl_line(0x138)
	.dwattr $C$DW$642, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$56, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$56, DW_AT_decl_line(0x137)
	.dwattr $C$DW$T$56, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$56

$C$DW$T$467	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$467, DW_AT_name("SlSockSecureMask_t")
	.dwattr $C$DW$T$467, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$T$467, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$467, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$467, DW_AT_decl_line(0x139)
	.dwattr $C$DW$T$467, DW_AT_decl_column(0x03)


$C$DW$T$57	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$57, DW_AT_byte_size(0x01)
$C$DW$643	.dwtag  DW_TAG_member
	.dwattr $C$DW$643, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$643, DW_AT_name("SecureMethod")
	.dwattr $C$DW$643, DW_AT_TI_symbol_name("SecureMethod")
	.dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$643, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$643, DW_AT_decl_line(0x13d)
	.dwattr $C$DW$643, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$57, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$57, DW_AT_decl_line(0x13c)
	.dwattr $C$DW$T$57, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$57

$C$DW$T$468	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$468, DW_AT_name("SlSockSecureMethod_t")
	.dwattr $C$DW$T$468, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$T$468, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$468, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$468, DW_AT_decl_line(0x13e)
	.dwattr $C$DW$T$468, DW_AT_decl_column(0x03)


$C$DW$T$61	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$61, DW_AT_byte_size(0x38)
$C$DW$644	.dwtag  DW_TAG_member
	.dwattr $C$DW$644, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$644, DW_AT_name("SubjectNameXoredSha1")
	.dwattr $C$DW$644, DW_AT_TI_symbol_name("SubjectNameXoredSha1")
	.dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$644, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$644, DW_AT_decl_line(0x142)
	.dwattr $C$DW$644, DW_AT_decl_column(0x0a)

$C$DW$645	.dwtag  DW_TAG_member
	.dwattr $C$DW$645, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$645, DW_AT_name("IssuerNameXoredSha1")
	.dwattr $C$DW$645, DW_AT_TI_symbol_name("IssuerNameXoredSha1")
	.dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$645, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$645, DW_AT_decl_line(0x143)
	.dwattr $C$DW$645, DW_AT_decl_column(0x0a)

$C$DW$646	.dwtag  DW_TAG_member
	.dwattr $C$DW$646, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$646, DW_AT_name("FromDate")
	.dwattr $C$DW$646, DW_AT_TI_symbol_name("FromDate")
	.dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$646, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$646, DW_AT_decl_line(0x144)
	.dwattr $C$DW$646, DW_AT_decl_column(0x0a)

$C$DW$647	.dwtag  DW_TAG_member
	.dwattr $C$DW$647, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$647, DW_AT_name("ToDate")
	.dwattr $C$DW$647, DW_AT_TI_symbol_name("ToDate")
	.dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$647, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$647, DW_AT_decl_line(0x145)
	.dwattr $C$DW$647, DW_AT_decl_column(0x0a)

$C$DW$648	.dwtag  DW_TAG_member
	.dwattr $C$DW$648, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$648, DW_AT_name("SubjectName")
	.dwattr $C$DW$648, DW_AT_TI_symbol_name("SubjectName")
	.dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$648, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$648, DW_AT_decl_line(0x146)
	.dwattr $C$DW$648, DW_AT_decl_column(0x0a)

$C$DW$649	.dwtag  DW_TAG_member
	.dwattr $C$DW$649, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$649, DW_AT_name("IssuerName")
	.dwattr $C$DW$649, DW_AT_TI_symbol_name("IssuerName")
	.dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$649, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$649, DW_AT_decl_line(0x147)
	.dwattr $C$DW$649, DW_AT_decl_column(0x0a)

$C$DW$650	.dwtag  DW_TAG_member
	.dwattr $C$DW$650, DW_AT_type(*$C$DW$T$5)
	.dwattr $C$DW$650, DW_AT_name("SubjectNameLen")
	.dwattr $C$DW$650, DW_AT_TI_symbol_name("SubjectNameLen")
	.dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$650, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$650, DW_AT_decl_line(0x148)
	.dwattr $C$DW$650, DW_AT_decl_column(0x0a)

$C$DW$651	.dwtag  DW_TAG_member
	.dwattr $C$DW$651, DW_AT_type(*$C$DW$T$5)
	.dwattr $C$DW$651, DW_AT_name("IssuerNameLen")
	.dwattr $C$DW$651, DW_AT_TI_symbol_name("IssuerNameLen")
	.dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
	.dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$651, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$651, DW_AT_decl_line(0x149)
	.dwattr $C$DW$651, DW_AT_decl_column(0x0a)

$C$DW$652	.dwtag  DW_TAG_member
	.dwattr $C$DW$652, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$652, DW_AT_name("Padding")
	.dwattr $C$DW$652, DW_AT_TI_symbol_name("Padding")
	.dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$652, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$652, DW_AT_decl_line(0x14a)
	.dwattr $C$DW$652, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$61, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$61, DW_AT_decl_line(0x141)
	.dwattr $C$DW$T$61, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$61

$C$DW$T$62	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$62, DW_AT_name("SlSockSSLCertInfo_t")
	.dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$62, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$62, DW_AT_decl_line(0x14b)
	.dwattr $C$DW$T$62, DW_AT_decl_column(0x03)


$C$DW$T$63	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$63, DW_AT_byte_size(0x48)
$C$DW$653	.dwtag  DW_TAG_member
	.dwattr $C$DW$653, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$653, DW_AT_name("SecureVersion")
	.dwattr $C$DW$653, DW_AT_TI_symbol_name("SecureVersion")
	.dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$653, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$653, DW_AT_decl_line(0x150)
	.dwattr $C$DW$653, DW_AT_decl_column(0x0e)

$C$DW$654	.dwtag  DW_TAG_member
	.dwattr $C$DW$654, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$654, DW_AT_name("SecureCipherSuit")
	.dwattr $C$DW$654, DW_AT_TI_symbol_name("SecureCipherSuit")
	.dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$654, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$654, DW_AT_decl_line(0x151)
	.dwattr $C$DW$654, DW_AT_decl_column(0x0e)

$C$DW$655	.dwtag  DW_TAG_member
	.dwattr $C$DW$655, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$655, DW_AT_name("SecureIsPeerValidated")
	.dwattr $C$DW$655, DW_AT_TI_symbol_name("SecureIsPeerValidated")
	.dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$655, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$655, DW_AT_decl_line(0x152)
	.dwattr $C$DW$655, DW_AT_decl_column(0x0e)

$C$DW$656	.dwtag  DW_TAG_member
	.dwattr $C$DW$656, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$656, DW_AT_name("SecureALPNChosenProtocol")
	.dwattr $C$DW$656, DW_AT_TI_symbol_name("SecureALPNChosenProtocol")
	.dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$656, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$656, DW_AT_decl_line(0x153)
	.dwattr $C$DW$656, DW_AT_decl_column(0x0e)

$C$DW$657	.dwtag  DW_TAG_member
	.dwattr $C$DW$657, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$657, DW_AT_name("SecurePeerCertinfo")
	.dwattr $C$DW$657, DW_AT_TI_symbol_name("SecurePeerCertinfo")
	.dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$657, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$657, DW_AT_decl_line(0x15a)
	.dwattr $C$DW$657, DW_AT_decl_column(0x19)

	.dwattr $C$DW$T$63, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$63, DW_AT_decl_line(0x14f)
	.dwattr $C$DW$T$63, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$63

$C$DW$T$469	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$469, DW_AT_name("SlSockSSLConnectionParams_t")
	.dwattr $C$DW$T$469, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$T$469, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$469, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$469, DW_AT_decl_line(0x15b)
	.dwattr $C$DW$T$469, DW_AT_decl_column(0x03)


$C$DW$T$65	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$65, DW_AT_byte_size(0x08)
$C$DW$658	.dwtag  DW_TAG_member
	.dwattr $C$DW$658, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$658, DW_AT_name("imr_multiaddr")
	.dwattr $C$DW$658, DW_AT_TI_symbol_name("imr_multiaddr")
	.dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$658, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$658, DW_AT_decl_line(0x167)
	.dwattr $C$DW$658, DW_AT_decl_column(0x12)

$C$DW$659	.dwtag  DW_TAG_member
	.dwattr $C$DW$659, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$659, DW_AT_name("imr_interface")
	.dwattr $C$DW$659, DW_AT_TI_symbol_name("imr_interface")
	.dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$659, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$659, DW_AT_decl_line(0x168)
	.dwattr $C$DW$659, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$65, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$65, DW_AT_decl_line(0x166)
	.dwattr $C$DW$T$65, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$65

$C$DW$T$470	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$470, DW_AT_name("SlSockIpMreq_t")
	.dwattr $C$DW$T$470, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$T$470, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$470, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$470, DW_AT_decl_line(0x169)
	.dwattr $C$DW$T$470, DW_AT_decl_column(0x02)


$C$DW$T$67	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$67, DW_AT_byte_size(0x14)
$C$DW$660	.dwtag  DW_TAG_member
	.dwattr $C$DW$660, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$660, DW_AT_name("ipv6mr_multiaddr")
	.dwattr $C$DW$660, DW_AT_TI_symbol_name("ipv6mr_multiaddr")
	.dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$660, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$660, DW_AT_decl_line(0x16c)
	.dwattr $C$DW$660, DW_AT_decl_column(0x11)

$C$DW$661	.dwtag  DW_TAG_member
	.dwattr $C$DW$661, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$661, DW_AT_name("ipv6mr_interface")
	.dwattr $C$DW$661, DW_AT_TI_symbol_name("ipv6mr_interface")
	.dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$661, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$661, DW_AT_decl_line(0x16d)
	.dwattr $C$DW$661, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$67, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$67, DW_AT_decl_line(0x16b)
	.dwattr $C$DW$T$67, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$67

$C$DW$T$471	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$471, DW_AT_name("SlSockIpV6Mreq_t")
	.dwattr $C$DW$T$471, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$T$471, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$471, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$471, DW_AT_decl_line(0x16e)
	.dwattr $C$DW$T$471, DW_AT_decl_column(0x02)


$C$DW$T$68	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$68, DW_AT_byte_size(0x08)
$C$DW$662	.dwtag  DW_TAG_member
	.dwattr $C$DW$662, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$662, DW_AT_name("l_onoff")
	.dwattr $C$DW$662, DW_AT_TI_symbol_name("l_onoff")
	.dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$662, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$662, DW_AT_decl_line(0x172)
	.dwattr $C$DW$662, DW_AT_decl_column(0x0a)

$C$DW$663	.dwtag  DW_TAG_member
	.dwattr $C$DW$663, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$663, DW_AT_name("l_linger")
	.dwattr $C$DW$663, DW_AT_TI_symbol_name("l_linger")
	.dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$663, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$663, DW_AT_decl_line(0x173)
	.dwattr $C$DW$663, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$68, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$68, DW_AT_decl_line(0x171)
	.dwattr $C$DW$T$68, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$68

$C$DW$T$472	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$472, DW_AT_name("SlSocklinger_t")
	.dwattr $C$DW$T$472, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$T$472, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$472, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$472, DW_AT_decl_line(0x174)
	.dwattr $C$DW$T$472, DW_AT_decl_column(0x02)


$C$DW$T$70	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$70, DW_AT_byte_size(0x04)
$C$DW$664	.dwtag  DW_TAG_member
	.dwattr $C$DW$664, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$664, DW_AT_name("SecureFiles")
	.dwattr $C$DW$664, DW_AT_TI_symbol_name("SecureFiles")
	.dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$664, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$664, DW_AT_decl_line(0x19e)
	.dwattr $C$DW$664, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$70, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$70, DW_AT_decl_line(0x19d)
	.dwattr $C$DW$T$70, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$70

$C$DW$T$473	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$473, DW_AT_name("SlSockSecureFiles_t")
	.dwattr $C$DW$T$473, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$T$473, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$473, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$473, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$T$473, DW_AT_decl_column(0x02)


$C$DW$T$71	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$71, DW_AT_byte_size(0x08)
$C$DW$665	.dwtag  DW_TAG_member
	.dwattr $C$DW$665, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$665, DW_AT_name("Rate")
	.dwattr $C$DW$665, DW_AT_TI_symbol_name("Rate")
	.dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$665, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$665, DW_AT_decl_line(0x1a8)
	.dwattr $C$DW$665, DW_AT_decl_column(0x0b)

$C$DW$666	.dwtag  DW_TAG_member
	.dwattr $C$DW$666, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$666, DW_AT_name("Channel")
	.dwattr $C$DW$666, DW_AT_TI_symbol_name("Channel")
	.dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$666, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$666, DW_AT_decl_line(0x1a9)
	.dwattr $C$DW$666, DW_AT_decl_column(0x0b)

$C$DW$667	.dwtag  DW_TAG_member
	.dwattr $C$DW$667, DW_AT_type(*$C$DW$T$5)
	.dwattr $C$DW$667, DW_AT_name("Rssi")
	.dwattr $C$DW$667, DW_AT_TI_symbol_name("Rssi")
	.dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$667, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$667, DW_AT_decl_line(0x1aa)
	.dwattr $C$DW$667, DW_AT_decl_column(0x0b)

$C$DW$668	.dwtag  DW_TAG_member
	.dwattr $C$DW$668, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$668, DW_AT_name("Padding")
	.dwattr $C$DW$668, DW_AT_TI_symbol_name("Padding")
	.dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$668, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$668, DW_AT_decl_line(0x1ab)
	.dwattr $C$DW$668, DW_AT_decl_column(0x0b)

$C$DW$669	.dwtag  DW_TAG_member
	.dwattr $C$DW$669, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$669, DW_AT_name("Timestamp")
	.dwattr $C$DW$669, DW_AT_TI_symbol_name("Timestamp")
	.dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$669, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$669, DW_AT_decl_line(0x1ac)
	.dwattr $C$DW$669, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$71, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$71, DW_AT_decl_line(0x1a7)
	.dwattr $C$DW$T$71, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$71

$C$DW$T$474	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$474, DW_AT_name("SlTransceiverRxOverHead_t")
	.dwattr $C$DW$T$474, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$T$474, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$474, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$474, DW_AT_decl_line(0x1ad)
	.dwattr $C$DW$T$474, DW_AT_decl_column(0x02)


$C$DW$T$72	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$72, DW_AT_byte_size(0x0c)
$C$DW$670	.dwtag  DW_TAG_member
	.dwattr $C$DW$670, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$670, DW_AT_name("Ip")
	.dwattr $C$DW$670, DW_AT_TI_symbol_name("Ip")
	.dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$670, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$670, DW_AT_decl_line(0xd2)
	.dwattr $C$DW$670, DW_AT_decl_column(0x0a)

$C$DW$671	.dwtag  DW_TAG_member
	.dwattr $C$DW$671, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$671, DW_AT_name("Gateway")
	.dwattr $C$DW$671, DW_AT_TI_symbol_name("Gateway")
	.dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$671, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$671, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$671, DW_AT_decl_column(0x0a)

$C$DW$672	.dwtag  DW_TAG_member
	.dwattr $C$DW$672, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$672, DW_AT_name("Dns")
	.dwattr $C$DW$672, DW_AT_TI_symbol_name("Dns")
	.dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$672, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$672, DW_AT_decl_line(0xd4)
	.dwattr $C$DW$672, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$72, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$72, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$T$72, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$72

$C$DW$T$213	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$213, DW_AT_name("SlIpV4AcquiredAsync_t")
	.dwattr $C$DW$T$213, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$T$213, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$213, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$213, DW_AT_decl_line(0xd5)
	.dwattr $C$DW$T$213, DW_AT_decl_column(0x02)


$C$DW$T$73	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$73, DW_AT_byte_size(0x20)
$C$DW$673	.dwtag  DW_TAG_member
	.dwattr $C$DW$673, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$673, DW_AT_name("Ip")
	.dwattr $C$DW$673, DW_AT_TI_symbol_name("Ip")
	.dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$673, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$673, DW_AT_decl_line(0xdf)
	.dwattr $C$DW$673, DW_AT_decl_column(0x0a)

$C$DW$674	.dwtag  DW_TAG_member
	.dwattr $C$DW$674, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$674, DW_AT_name("Dns")
	.dwattr $C$DW$674, DW_AT_TI_symbol_name("Dns")
	.dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$674, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$674, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$674, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$73, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$73, DW_AT_decl_line(0xde)
	.dwattr $C$DW$T$73, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$73

$C$DW$T$214	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$214, DW_AT_name("SlIpV6AcquiredAsync_t")
	.dwattr $C$DW$T$214, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$T$214, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$214, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$214, DW_AT_decl_line(0xe1)
	.dwattr $C$DW$T$214, DW_AT_decl_column(0x02)


$C$DW$T$74	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$74, DW_AT_byte_size(0x10)
$C$DW$675	.dwtag  DW_TAG_member
	.dwattr $C$DW$675, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$675, DW_AT_name("IpAddress")
	.dwattr $C$DW$675, DW_AT_TI_symbol_name("IpAddress")
	.dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$675, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$675, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$675, DW_AT_decl_column(0x0d)

$C$DW$676	.dwtag  DW_TAG_member
	.dwattr $C$DW$676, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$676, DW_AT_name("LeaseTime")
	.dwattr $C$DW$676, DW_AT_TI_symbol_name("LeaseTime")
	.dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$676, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$676, DW_AT_decl_line(0xe6)
	.dwattr $C$DW$676, DW_AT_decl_column(0x0d)

$C$DW$677	.dwtag  DW_TAG_member
	.dwattr $C$DW$677, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$677, DW_AT_name("Mac")
	.dwattr $C$DW$677, DW_AT_TI_symbol_name("Mac")
	.dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$677, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$677, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$677, DW_AT_decl_column(0x0d)

$C$DW$678	.dwtag  DW_TAG_member
	.dwattr $C$DW$678, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$678, DW_AT_name("Padding")
	.dwattr $C$DW$678, DW_AT_TI_symbol_name("Padding")
	.dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$678, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$678, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$678, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$74, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$74, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$T$74, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$74

$C$DW$T$215	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$215, DW_AT_name("SlIpLeasedAsync_t")
	.dwattr $C$DW$T$215, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$T$215, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$215, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$215, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$T$215, DW_AT_decl_column(0x02)


$C$DW$T$75	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$75, DW_AT_byte_size(0x0c)
$C$DW$679	.dwtag  DW_TAG_member
	.dwattr $C$DW$679, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$679, DW_AT_name("IpAddress")
	.dwattr $C$DW$679, DW_AT_TI_symbol_name("IpAddress")
	.dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$679, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$679, DW_AT_decl_line(0xed)
	.dwattr $C$DW$679, DW_AT_decl_column(0x0d)

$C$DW$680	.dwtag  DW_TAG_member
	.dwattr $C$DW$680, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$680, DW_AT_name("Mac")
	.dwattr $C$DW$680, DW_AT_TI_symbol_name("Mac")
	.dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$680, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$680, DW_AT_decl_line(0xee)
	.dwattr $C$DW$680, DW_AT_decl_column(0x0d)

$C$DW$681	.dwtag  DW_TAG_member
	.dwattr $C$DW$681, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$681, DW_AT_name("Reason")
	.dwattr $C$DW$681, DW_AT_TI_symbol_name("Reason")
	.dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$681, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$681, DW_AT_decl_line(0xef)
	.dwattr $C$DW$681, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$75, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$75, DW_AT_decl_line(0xec)
	.dwattr $C$DW$T$75, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$75

$C$DW$T$216	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$216, DW_AT_name("SlIpReleasedAsync_t")
	.dwattr $C$DW$T$216, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$T$216, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$216, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$216, DW_AT_decl_line(0xf0)
	.dwattr $C$DW$T$216, DW_AT_decl_column(0x02)


$C$DW$T$76	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$76, DW_AT_byte_size(0x10)
$C$DW$682	.dwtag  DW_TAG_member
	.dwattr $C$DW$682, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$682, DW_AT_name("IpAddress")
	.dwattr $C$DW$682, DW_AT_TI_symbol_name("IpAddress")
	.dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$682, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$682, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$682, DW_AT_decl_column(0x0d)

$C$DW$683	.dwtag  DW_TAG_member
	.dwattr $C$DW$683, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$683, DW_AT_name("DhcpMac")
	.dwattr $C$DW$683, DW_AT_TI_symbol_name("DhcpMac")
	.dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$683, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$683, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$683, DW_AT_decl_column(0x0d)

$C$DW$684	.dwtag  DW_TAG_member
	.dwattr $C$DW$684, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$684, DW_AT_name("ConflictMac")
	.dwattr $C$DW$684, DW_AT_TI_symbol_name("ConflictMac")
	.dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$684, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$684, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$684, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$76, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$76, DW_AT_decl_line(0xf3)
	.dwattr $C$DW$T$76, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$76

$C$DW$T$219	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$219, DW_AT_name("SlIpCollisionAsync_t")
	.dwattr $C$DW$T$219, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$T$219, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$219, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$219, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$T$219, DW_AT_decl_column(0x02)


$C$DW$T$77	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$77, DW_AT_byte_size(0x04)
$C$DW$685	.dwtag  DW_TAG_member
	.dwattr $C$DW$685, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$685, DW_AT_name("Status")
	.dwattr $C$DW$685, DW_AT_TI_symbol_name("Status")
	.dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$685, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$685, DW_AT_decl_line(0xfb)
	.dwattr $C$DW$685, DW_AT_decl_column(0x0b)

$C$DW$686	.dwtag  DW_TAG_member
	.dwattr $C$DW$686, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$686, DW_AT_name("Padding")
	.dwattr $C$DW$686, DW_AT_TI_symbol_name("Padding")
	.dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$686, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$686, DW_AT_decl_line(0xfc)
	.dwattr $C$DW$686, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$77, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$77, DW_AT_decl_line(0xfa)
	.dwattr $C$DW$T$77, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$77

$C$DW$T$217	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$217, DW_AT_name("SlIpV4Lost_t")
	.dwattr $C$DW$T$217, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$T$217, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$217, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$217, DW_AT_decl_line(0xfd)
	.dwattr $C$DW$T$217, DW_AT_decl_column(0x02)


$C$DW$T$78	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$78, DW_AT_byte_size(0x10)
$C$DW$687	.dwtag  DW_TAG_member
	.dwattr $C$DW$687, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$687, DW_AT_name("IpLost")
	.dwattr $C$DW$687, DW_AT_TI_symbol_name("IpLost")
	.dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$687, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$687, DW_AT_decl_line(0x101)
	.dwattr $C$DW$687, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$78, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$78, DW_AT_decl_line(0x100)
	.dwattr $C$DW$T$78, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$78

$C$DW$T$220	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$220, DW_AT_name("SlIpV6Lost_t")
	.dwattr $C$DW$T$220, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$T$220, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$220, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$220, DW_AT_decl_line(0x102)
	.dwattr $C$DW$T$220, DW_AT_decl_column(0x02)


$C$DW$T$79	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$79, DW_AT_byte_size(0x04)
$C$DW$688	.dwtag  DW_TAG_member
	.dwattr $C$DW$688, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$688, DW_AT_name("Status")
	.dwattr $C$DW$688, DW_AT_TI_symbol_name("Status")
	.dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$688, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$688, DW_AT_decl_line(0x106)
	.dwattr $C$DW$688, DW_AT_decl_column(0x0b)

$C$DW$689	.dwtag  DW_TAG_member
	.dwattr $C$DW$689, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$689, DW_AT_name("Padding")
	.dwattr $C$DW$689, DW_AT_TI_symbol_name("Padding")
	.dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$689, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$689, DW_AT_decl_line(0x107)
	.dwattr $C$DW$689, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$79, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$79, DW_AT_decl_line(0x105)
	.dwattr $C$DW$T$79, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$79

$C$DW$T$218	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$218, DW_AT_name("SlDhcpIpAcquireTimeout_t")
	.dwattr $C$DW$T$218, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$T$218, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$218, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$218, DW_AT_decl_line(0x108)
	.dwattr $C$DW$T$218, DW_AT_decl_column(0x02)


$C$DW$T$81	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$81, DW_AT_byte_size(0x24)
$C$DW$690	.dwtag  DW_TAG_member
	.dwattr $C$DW$690, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$690, DW_AT_name("Id")
	.dwattr $C$DW$690, DW_AT_TI_symbol_name("Id")
	.dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$690, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$690, DW_AT_decl_line(0x119)
	.dwattr $C$DW$690, DW_AT_decl_column(0x1e)

$C$DW$691	.dwtag  DW_TAG_member
	.dwattr $C$DW$691, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$691, DW_AT_name("Data")
	.dwattr $C$DW$691, DW_AT_TI_symbol_name("Data")
	.dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$691, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$691, DW_AT_decl_line(0x11a)
	.dwattr $C$DW$691, DW_AT_decl_column(0x1e)

	.dwattr $C$DW$T$81, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$81, DW_AT_decl_line(0x118)
	.dwattr $C$DW$T$81, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$81

$C$DW$T$475	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$475, DW_AT_name("SlNetAppEvent_t")
	.dwattr $C$DW$T$475, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$T$475, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$475, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$475, DW_AT_decl_line(0x11b)
	.dwattr $C$DW$T$475, DW_AT_decl_column(0x02)


$C$DW$T$82	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$82, DW_AT_byte_size(0x14)
$C$DW$692	.dwtag  DW_TAG_member
	.dwattr $C$DW$692, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$692, DW_AT_name("PacketsSent")
	.dwattr $C$DW$692, DW_AT_TI_symbol_name("PacketsSent")
	.dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$692, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$692, DW_AT_decl_line(0x11f)
	.dwattr $C$DW$692, DW_AT_decl_column(0x0d)

$C$DW$693	.dwtag  DW_TAG_member
	.dwattr $C$DW$693, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$693, DW_AT_name("PacketsReceived")
	.dwattr $C$DW$693, DW_AT_TI_symbol_name("PacketsReceived")
	.dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$693, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$693, DW_AT_decl_line(0x120)
	.dwattr $C$DW$693, DW_AT_decl_column(0x0d)

$C$DW$694	.dwtag  DW_TAG_member
	.dwattr $C$DW$694, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$694, DW_AT_name("MinRoundTime")
	.dwattr $C$DW$694, DW_AT_TI_symbol_name("MinRoundTime")
	.dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
