TI ARM Assembler Unix v16.9.6 Thu Dec 28 17:45:45 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                      Unix v16.9.6.LTS *
       3                    ;* Date/Time created: Thu Dec 28 17:45:45 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --embedded_constants=on
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/slnetif/slnet
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen Unix v16.9.6.LTS Copyright (c) 1996-
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/slnetif/c
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    5684                            .dwattr $C$DW$556, DW_AT_const_value(0x02)
    5685                            .dwattr $C$DW$556, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/eventre
    5686                            .dwattr $C$DW$556, DW_AT_decl_line(0x3d)
    5687                            .dwattr $C$DW$556, DW_AT_decl_column(0x05)
    5688                    
    5689                    $C$DW$557       .dwtag  DW_TAG_enumerator
    5690                            .dwattr $C$DW$557, DW_AT_name("SL_EVENT_HDL_NETAPP")
    5691                            .dwattr $C$DW$557, DW_AT_const_value(0x03)
    5692                            .dwattr $C$DW$557, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/eventre
    5693                            .dwattr $C$DW$557, DW_AT_decl_line(0x3e)
    5694                            .dwattr $C$DW$557, DW_AT_decl_column(0x05)
    5695                    
    5696                    $C$DW$558       .dwtag  DW_TAG_enumerator
    5697                            .dwattr $C$DW$558, DW_AT_name("SL_EVENT_HDL_SOCKET")
    5698                            .dwattr $C$DW$558, DW_AT_const_value(0x04)
    5699                            .dwattr $C$DW$558, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/eventre
    5700                            .dwattr $C$DW$558, DW_AT_decl_line(0x3f)
    5701                            .dwattr $C$DW$558, DW_AT_decl_column(0x05)
    5702                    
    5703                    $C$DW$559       .dwtag  DW_TAG_enumerator
    5704                            .dwattr $C$DW$559, DW_AT_name("SL_EVENT_HDL_HTTP_SERVER")
    5705                            .dwattr $C$DW$559, DW_AT_const_value(0x05)
    5706                            .dwattr $C$DW$559, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/eventre
    5707                            .dwattr $C$DW$559, DW_AT_decl_line(0x40)
    5708                            .dwattr $C$DW$559, DW_AT_decl_column(0x05)
    5709                    
    5710                    $C$DW$560       .dwtag  DW_TAG_enumerator
    5711                            .dwattr $C$DW$560, DW_AT_name("SL_EVENT_HDL_NETAPP_REQUEST")
    5712                            .dwattr $C$DW$560, DW_AT_const_value(0x06)
    5713                            .dwattr $C$DW$560, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/eventre
    5714                            .dwattr $C$DW$560, DW_AT_decl_line(0x41)
    5715                            .dwattr $C$DW$560, DW_AT_decl_column(0x05)
    5716                    
TI ARM Assembler Unix v16.9.6 Thu Dec 28 17:45:45 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  105

    5717                    $C$DW$561       .dwtag  DW_TAG_enumerator
    5718                            .dwattr $C$DW$561, DW_AT_name("SL_EVENT_HDL_MEM_FREE")
    5719                            .dwattr $C$DW$561, DW_AT_const_value(0x07)
    5720                            .dwattr $C$DW$561, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/eventre
    5721                            .dwattr $C$DW$561, DW_AT_decl_line(0x42)
    5722                            .dwattr $C$DW$561, DW_AT_decl_column(0x05)
    5723                    
    5724                    $C$DW$562       .dwtag  DW_TAG_enumerator
    5725                            .dwattr $C$DW$562, DW_AT_name("SL_EVENT_HDL_SOCKET_TRIGGER")
    5726                            .dwattr $C$DW$562, DW_AT_const_value(0x08)
    5727                            .dwattr $C$DW$562, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/eventre
    5728                            .dwattr $C$DW$562, DW_AT_decl_line(0x43)
    5729                            .dwattr $C$DW$562, DW_AT_decl_column(0x05)
    5730                    
    5731                    $C$DW$563       .dwtag  DW_TAG_enumerator
    5732                            .dwattr $C$DW$563, DW_AT_name("SL_NUM_OF_EVENT_TYPES")
    5733                            .dwattr $C$DW$563, DW_AT_const_value(0x09)
    5734                            .dwattr $C$DW$563, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/eventre
    5735                            .dwattr $C$DW$563, DW_AT_decl_line(0x44)
    5736                            .dwattr $C$DW$563, DW_AT_decl_column(0x05)
    5737                    
    5738                            .dwattr $C$DW$T$447, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/event
    5739                            .dwattr $C$DW$T$447, DW_AT_decl_line(0x3a)
    5740                            .dwattr $C$DW$T$447, DW_AT_decl_column(0x01)
    5741                            .dwendtag $C$DW$T$447
    5742                    
    5743                    $C$DW$T$448     .dwtag  DW_TAG_typedef
    5744                            .dwattr $C$DW$T$448, DW_AT_name("SlEventHandler_e")
    5745                            .dwattr $C$DW$T$448, DW_AT_type(*$C$DW$T$447)
    5746                            .dwattr $C$DW$T$448, DW_AT_language(DW_LANG_C)
    5747                            .dwattr $C$DW$T$448, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/event
    5748                            .dwattr $C$DW$T$448, DW_AT_decl_line(0x45)
    5749                            .dwattr $C$DW$T$448, DW_AT_decl_column(0x02)
    5750                    
    5751                    
    5752                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    5753                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x28)
    5754                    $C$DW$564       .dwtag  DW_TAG_member
    5755                            .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$6)
    5756                            .dwattr $C$DW$564, DW_AT_name("SsidLen")
    5757                            .dwattr $C$DW$564, DW_AT_TI_symbol_name("SsidLen")
    5758                            .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5759                            .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    5760                            .dwattr $C$DW$564, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h"
    5761                            .dwattr $C$DW$564, DW_AT_decl_line(0x1fd)
    5762                            .dwattr $C$DW$564, DW_AT_decl_column(0x0d)
    5763                    
    5764                    $C$DW$565       .dwtag  DW_TAG_member
    5765                            .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$19)
    5766                            .dwattr $C$DW$565, DW_AT_name("SsidName")
    5767                            .dwattr $C$DW$565, DW_AT_TI_symbol_name("SsidName")
    5768                            .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5769                            .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    5770                            .dwattr $C$DW$565, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h"
    5771                            .dwattr $C$DW$565, DW_AT_decl_line(0x1fe)
TI ARM Assembler Unix v16.9.6 Thu Dec 28 17:45:45 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  106

    5772                            .dwattr $C$DW$565, DW_AT_decl_column(0x0d)
    5773                    
    5774                    $C$DW$566       .dwtag  DW_TAG_member
    5775                            .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$20)
    5776                            .dwattr $C$DW$566, DW_AT_name("Bssid")
    5777                            .dwattr $C$DW$566, DW_AT_TI_symbol_name("Bssid")
    5778                            .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    5779                            .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    5780                            .dwattr $C$DW$566, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h"
    5781                            .dwattr $C$DW$566, DW_AT_decl_line(0x1ff)
    5782                            .dwattr $C$DW$566, DW_AT_decl_column(0x0d)
    5783                    
    5784                    $C$DW$567       .dwtag  DW_TAG_member
    5785                            .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$6)
    5786                            .dwattr $C$DW$567, DW_AT_name("Padding")
    5787                            .dwattr $C$DW$567, DW_AT_TI_symbol_name("Padding")
    5788                            .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    5789                            .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    5790                            .dwattr $C$DW$567, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h"
    5791                            .dwattr $C$DW$567, DW_AT_decl_line(0x200)
    5792                            .dwattr $C$DW$567, DW_AT_decl_column(0x0d)
    5793                    
    5794                            .dwattr $C$DW$T$21, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h
    5795                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x1fc)
    5796                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x01)
    5797                            .dwendtag $C$DW$T$21
    5798                    
    5799                    $C$DW$T$197     .dwtag  DW_TAG_typedef
    5800                            .dwattr $C$DW$T$197, DW_AT_name("SlWlanEventConnect_t")
    5801                            .dwattr $C$DW$T$197, DW_AT_type(*$C$DW$T$21)
    5802                            .dwattr $C$DW$T$197, DW_AT_language(DW_LANG_C)
    5803                            .dwattr $C$DW$T$197, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.
    5804                            .dwattr $C$DW$T$197, DW_AT_decl_line(0x201)
    5805                            .dwattr $C$DW$T$197, DW_AT_decl_column(0x03)
    5806                    
    5807                    
    5808                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    5809                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x4c)
    5810                    $C$DW$568       .dwtag  DW_TAG_member
    5811                            .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$6)
    5812                            .dwattr $C$DW$568, DW_AT_name("SsidLen")
    5813                            .dwattr $C$DW$568, DW_AT_TI_symbol_name("SsidLen")
    5814                            .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5815                            .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    5816                            .dwattr $C$DW$568, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h"
    5817                            .dwattr $C$DW$568, DW_AT_decl_line(0x214)
    5818                            .dwattr $C$DW$568, DW_AT_decl_column(0x0d)
    5819                    
    5820                    $C$DW$569       .dwtag  DW_TAG_member
    5821                            .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$19)
    5822                            .dwattr $C$DW$569, DW_AT_name("SsidName")
    5823                            .dwattr $C$DW$569, DW_AT_TI_symbol_name("SsidName")
    5824                            .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5825                            .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    5826                            .dwattr $C$DW$569, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h"
TI ARM Assembler Unix v16.9.6 Thu Dec 28 17:45:45 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  107

    5827                            .dwattr $C$DW$569, DW_AT_decl_line(0x215)
    5828                            .dwattr $C$DW$569, DW_AT_decl_column(0x0d)
    5829                    
    5830                    $C$DW$570       .dwtag  DW_TAG_member
    5831                            .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$20)
    5832                            .dwattr $C$DW$570, DW_AT_name("Bssid")
    5833                            .dwattr $C$DW$570, DW_AT_TI_symbol_name("Bssid")
    5834                            .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    5835                            .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    5836                            .dwattr $C$DW$570, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h"
    5837                            .dwattr $C$DW$570, DW_AT_decl_line(0x216)
    5838                            .dwattr $C$DW$570, DW_AT_decl_column(0x0d)
    5839                    
    5840                    $C$DW$571       .dwtag  DW_TAG_member
    5841                            .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$6)
    5842                            .dwattr $C$DW$571, DW_AT_name("Reserved")
    5843                            .dwattr $C$DW$571, DW_AT_TI_symbol_name("Reserved")
    5844                            .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    5845                            .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    5846                            .dwattr $C$DW$571, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h"
    5847                            .dwattr $C$DW$571, DW_AT_decl_line(0x217)
    5848                            .dwattr $C$DW$571, DW_AT_decl_column(0x0d)
    5849                    
    5850                    $C$DW$572       .dwtag  DW_TAG_member
    5851                            .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$6)
    5852                            .dwattr $C$DW$572, DW_AT_name("GoDeviceNameLen")
    5853                            .dwattr $C$DW$572, DW_AT_TI_symbol_name("GoDeviceNameLen")
    5854                            .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5855                            .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    5856                            .dwattr $C$DW$572, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h"
    5857                            .dwattr $C$DW$572, DW_AT_decl_line(0x218)
    5858                            .dwattr $C$DW$572, DW_AT_decl_column(0x0d)
    5859                    
    5860                    $C$DW$573       .dwtag  DW_TAG_member
    5861                            .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$19)
    5862                            .dwattr $C$DW$573, DW_AT_name("GoDeviceName")
    5863                            .dwattr $C$DW$573, DW_AT_TI_symbol_name("GoDeviceName")
    5864                            .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    5865                            .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    5866                            .dwattr $C$DW$573, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h"
    5867                            .dwattr $C$DW$573, DW_AT_decl_line(0x219)
    5868                            .dwattr $C$DW$573, DW_AT_decl_column(0x0d)
    5869                    
    5870                    $C$DW$574       .dwtag  DW_TAG_member
    5871                            .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$22)
    5872                            .dwattr $C$DW$574, DW_AT_name("Padding")
    5873                            .dwattr $C$DW$574, DW_AT_TI_symbol_name("Padding")
    5874                            .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    5875                            .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    5876                            .dwattr $C$DW$574, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h"
    5877                            .dwattr $C$DW$574, DW_AT_decl_line(0x21a)
    5878                            .dwattr $C$DW$574, DW_AT_decl_column(0x0d)
    5879                    
    5880                            .dwattr $C$DW$T$23, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h
    5881                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x213)
TI ARM Assembler Unix v16.9.6 Thu Dec 28 17:45:45 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  108

    5882                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x01)
    5883                            .dwendtag $C$DW$T$23
    5884                    
    5885                    $C$DW$T$198     .dwtag  DW_TAG_typedef
    5886                            .dwattr $C$DW$T$198, DW_AT_name("SlWlanEventP2PConnect_t")
    5887                            .dwattr $C$DW$T$198, DW_AT_type(*$C$DW$T$23)
    5888                            .dwattr $C$DW$T$198, DW_AT_language(DW_LANG_C)
    5889                            .dwattr $C$DW$T$198, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.
    5890                            .dwattr $C$DW$T$198, DW_AT_decl_line(0x21b)
    5891                            .dwattr $C$DW$T$198, DW_AT_decl_column(0x03)
    5892                    
    5893                    
    5894                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    5895                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x50)
    5896                    $C$DW$575       .dwtag  DW_TAG_member
    5897                            .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$6)
    5898                            .dwattr $C$DW$575, DW_AT_name("Mode")
    5899                            .dwattr $C$DW$575, DW_AT_TI_symbol_name("Mode")
    5900                            .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5901                            .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    5902                            .dwattr $C$DW$575, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h"
    5903                            .dwattr $C$DW$575, DW_AT_decl_line(0x2b3)
    5904                            .dwattr $C$DW$575, DW_AT_decl_column(0x09)
    5905                    
    5906                    $C$DW$576       .dwtag  DW_TAG_member
    5907                            .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$6)
    5908                            .dwattr $C$DW$576, DW_AT_name("ConnStatus")
    5909                            .dwattr $C$DW$576, DW_AT_TI_symbol_name("ConnStatus")
    5910                            .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5911                            .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    5912                            .dwattr $C$DW$576, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h"
    5913                            .dwattr $C$DW$576, DW_AT_decl_line(0x2b4)
    5914                            .dwattr $C$DW$576, DW_AT_decl_column(0x09)
    5915                    
    5916                    $C$DW$577       .dwtag  DW_TAG_member
    5917                            .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$6)
    5918                            .dwattr $C$DW$577, DW_AT_name("SecType")
    5919                            .dwattr $C$DW$577, DW_AT_TI_symbol_name("SecType")
    5920                            .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5921                            .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    5922                            .dwattr $C$DW$577, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h"
    5923                            .dwattr $C$DW$577, DW_AT_decl_line(0x2b5)
    5924                            .dwattr $C$DW$577, DW_AT_decl_column(0x09)
    5925                    
    5926                    $C$DW$578       .dwtag  DW_TAG_member
    5927                            .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$6)
    5928                            .dwattr $C$DW$578, DW_AT_name("Reserved")
    5929                            .dwattr $C$DW$578, DW_AT_TI_symbol_name("Reserved")
    5930                            .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5931                            .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    5932                            .dwattr $C$DW$578, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h"
    5933                            .dwattr $C$DW$578, DW_AT_decl_line(0x2b6)
    5934                            .dwattr $C$DW$578, DW_AT_decl_column(0x09)
    5935                    
    5936                    $C$DW$579       .dwtag  DW_TAG_member
TI ARM Assembler Unix v16.9.6 Thu Dec 28 17:45:45 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  109

    5937                            .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$24)
    5938                            .dwattr $C$DW$579, DW_AT_name("ConnectionInfo")
    5939                            .dwattr $C$DW$579, DW_AT_TI_symbol_name("ConnectionInfo")
    5940                            .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5941                            .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    5942                            .dwattr $C$DW$579, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h"
    5943                            .dwattr $C$DW$579, DW_AT_decl_line(0x2b7)
    5944                            .dwattr $C$DW$579, DW_AT_decl_column(0x1c)
    5945                    
    5946                            .dwattr $C$DW$T$25, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.h
    5947                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x2b2)
    5948                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
    5949                            .dwendtag $C$DW$T$25
    5950                    
    5951                    $C$DW$T$449     .dwtag  DW_TAG_typedef
    5952                            .dwattr $C$DW$T$449, DW_AT_name("SlWlanConnStatusParam_t")
    5953                            .dwattr $C$DW$T$449, DW_AT_type(*$C$DW$T$25)
    5954                            .dwattr $C$DW$T$449, DW_AT_language(DW_LANG_C)
    5955                            .dwattr $C$DW$T$449, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/wlan.
    5956                            .dwattr $C$DW$T$449, DW_AT_decl_line(0x2b8)
    5957                            .dwattr $C$DW$T$449, DW_AT_decl_column(0x02)
    5958                    
    5959                    
    5960                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    5961                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    5962                    $C$DW$580       .dwtag  DW_TAG_member
    5963                            .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$28)
    5964                            .dwattr $C$DW$580, DW_AT_name("pEntry")
    5965                            .dwattr $C$DW$580, DW_AT_TI_symbol_name("pEntry")
    5966                            .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5967                            .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    5968                            .dwattr $C$DW$580, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/porting
    5969                            .dwattr $C$DW$580, DW_AT_decl_line(0x64)
    5970                            .dwattr $C$DW$580, DW_AT_decl_column(0x13)
    5971                    
    5972                    $C$DW$581       .dwtag  DW_TAG_member
    5973                            .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$3)
    5974                            .dwattr $C$DW$581, DW_AT_name("pValue")
    5975                            .dwattr $C$DW$581, DW_AT_TI_symbol_name("pValue")
    5976                            .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5977                            .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    5978                            .dwattr $C$DW$581, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/porting
    5979                            .dwattr $C$DW$581, DW_AT_decl_line(0x65)
    5980                            .dwattr $C$DW$581, DW_AT_decl_column(0x0b)
    5981                    
    5982                            .dwattr $C$DW$T$29, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/portin
    5983                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x63)
    5984                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
    5985                            .dwendtag $C$DW$T$29
    5986                    
    5987                    $C$DW$T$451     .dwtag  DW_TAG_typedef
    5988                            .dwattr $C$DW$T$451, DW_AT_name("tSimpleLinkSpawnMsg")
    5989                            .dwattr $C$DW$T$451, DW_AT_type(*$C$DW$T$29)
    5990                            .dwattr $C$DW$T$451, DW_AT_language(DW_LANG_C)
    5991                            .dwattr $C$DW$T$451, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/porti
TI ARM Assembler Unix v16.9.6 Thu Dec 28 17:45:45 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  110

    5992                            .dwattr $C$DW$T$451, DW_AT_decl_line(0x66)
    5993                            .dwattr $C$DW$T$451, DW_AT_decl_column(0x02)
    5994                    
    5995                    
    5996                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    5997                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x24)
    5998                    $C$DW$582       .dwtag  DW_TAG_member
    5999                            .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$9)
    6000                            .dwattr $C$DW$582, DW_AT_name("Flags")
    6001                            .dwattr $C$DW$582, DW_AT_TI_symbol_name("Flags")
    6002                            .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6003                            .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    6004                            .dwattr $C$DW$582, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6005                            .dwattr $C$DW$582, DW_AT_decl_line(0x90)
    6006                            .dwattr $C$DW$582, DW_AT_decl_column(0x0b)
    6007                    
    6008                    $C$DW$583       .dwtag  DW_TAG_member
    6009                            .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$13)
    6010                            .dwattr $C$DW$583, DW_AT_name("Len")
    6011                            .dwattr $C$DW$583, DW_AT_TI_symbol_name("Len")
    6012                            .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6013                            .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    6014                            .dwattr $C$DW$583, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6015                            .dwattr $C$DW$583, DW_AT_decl_line(0x91)
    6016                            .dwattr $C$DW$583, DW_AT_decl_column(0x0b)
    6017                    
    6018                    $C$DW$584       .dwtag  DW_TAG_member
    6019                            .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$13)
    6020                            .dwattr $C$DW$584, DW_AT_name("MaxSize")
    6021                            .dwattr $C$DW$584, DW_AT_TI_symbol_name("MaxSize")
    6022                            .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6023                            .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    6024                            .dwattr $C$DW$584, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6025                            .dwattr $C$DW$584, DW_AT_decl_line(0x92)
    6026                            .dwattr $C$DW$584, DW_AT_decl_column(0x0b)
    6027                    
    6028                    $C$DW$585       .dwtag  DW_TAG_member
    6029                            .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$30)
    6030                            .dwattr $C$DW$585, DW_AT_name("Token")
    6031                            .dwattr $C$DW$585, DW_AT_TI_symbol_name("Token")
    6032                            .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6033                            .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    6034                            .dwattr $C$DW$585, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6035                            .dwattr $C$DW$585, DW_AT_decl_line(0x93)
    6036                            .dwattr $C$DW$585, DW_AT_decl_column(0x0b)
    6037                    
    6038                    $C$DW$586       .dwtag  DW_TAG_member
    6039                            .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$13)
    6040                            .dwattr $C$DW$586, DW_AT_name("StorageSize")
    6041                            .dwattr $C$DW$586, DW_AT_TI_symbol_name("StorageSize")
    6042                            .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6043                            .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    6044                            .dwattr $C$DW$586, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6045                            .dwattr $C$DW$586, DW_AT_decl_line(0x94)
    6046                            .dwattr $C$DW$586, DW_AT_decl_column(0x0b)
TI ARM Assembler Unix v16.9.6 Thu Dec 28 17:45:45 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  111

    6047                    
    6048                    $C$DW$587       .dwtag  DW_TAG_member
    6049                            .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$13)
    6050                            .dwattr $C$DW$587, DW_AT_name("WriteCounter")
    6051                            .dwattr $C$DW$587, DW_AT_TI_symbol_name("WriteCounter")
    6052                            .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6053                            .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    6054                            .dwattr $C$DW$587, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6055                            .dwattr $C$DW$587, DW_AT_decl_line(0x95)
    6056                            .dwattr $C$DW$587, DW_AT_decl_column(0x0b)
    6057                    
    6058                            .dwattr $C$DW$T$31, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6059                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x8f)
    6060                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x01)
    6061                            .dwendtag $C$DW$T$31
    6062                    
    6063                    $C$DW$T$452     .dwtag  DW_TAG_typedef
    6064                            .dwattr $C$DW$T$452, DW_AT_name("SlFsFileInfo_t")
    6065                            .dwattr $C$DW$T$452, DW_AT_type(*$C$DW$T$31)
    6066                            .dwattr $C$DW$T$452, DW_AT_language(DW_LANG_C)
    6067                            .dwattr $C$DW$T$452, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h"
    6068                            .dwattr $C$DW$T$452, DW_AT_decl_line(0x96)
    6069                            .dwattr $C$DW$T$452, DW_AT_decl_column(0x02)
    6070                    
    6071                    
    6072                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    6073                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x10)
    6074                    $C$DW$588       .dwtag  DW_TAG_member
    6075                            .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$30)
    6076                            .dwattr $C$DW$588, DW_AT_name("Key")
    6077                            .dwattr $C$DW$588, DW_AT_TI_symbol_name("Key")
    6078                            .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6079                            .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    6080                            .dwattr $C$DW$588, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6081                            .dwattr $C$DW$588, DW_AT_decl_line(0xb1)
    6082                            .dwattr $C$DW$588, DW_AT_decl_column(0x0b)
    6083                    
    6084                            .dwattr $C$DW$T$32, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6085                            .dwattr $C$DW$T$32, DW_AT_decl_line(0xb0)
    6086                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    6087                            .dwendtag $C$DW$T$32
    6088                    
    6089                    $C$DW$T$453     .dwtag  DW_TAG_typedef
    6090                            .dwattr $C$DW$T$453, DW_AT_name("SlFsKey_t")
    6091                            .dwattr $C$DW$T$453, DW_AT_type(*$C$DW$T$32)
    6092                            .dwattr $C$DW$T$453, DW_AT_language(DW_LANG_C)
    6093                            .dwattr $C$DW$T$453, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h"
    6094                            .dwattr $C$DW$T$453, DW_AT_decl_line(0xb2)
    6095                            .dwattr $C$DW$T$453, DW_AT_decl_column(0x02)
    6096                    
    6097                    
    6098                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    6099                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    6100                    $C$DW$589       .dwtag  DW_TAG_member
    6101                            .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$6)
TI ARM Assembler Unix v16.9.6 Thu Dec 28 17:45:45 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  112

    6102                            .dwattr $C$DW$589, DW_AT_name("Index")
    6103                            .dwattr $C$DW$589, DW_AT_TI_symbol_name("Index")
    6104                            .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6105                            .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    6106                            .dwattr $C$DW$589, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6107                            .dwattr $C$DW$589, DW_AT_decl_line(0xb6)
    6108                            .dwattr $C$DW$589, DW_AT_decl_column(0x09)
    6109                    
    6110                            .dwattr $C$DW$T$33, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6111                            .dwattr $C$DW$T$33, DW_AT_decl_line(0xb5)
    6112                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
    6113                            .dwendtag $C$DW$T$33
    6114                    
    6115                    $C$DW$T$207     .dwtag  DW_TAG_typedef
    6116                            .dwattr $C$DW$T$207, DW_AT_name("SlFsFileNameIndex_t")
    6117                            .dwattr $C$DW$T$207, DW_AT_type(*$C$DW$T$33)
    6118                            .dwattr $C$DW$T$207, DW_AT_language(DW_LANG_C)
    6119                            .dwattr $C$DW$T$207, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h"
    6120                            .dwattr $C$DW$T$207, DW_AT_decl_line(0xb7)
    6121                            .dwattr $C$DW$T$207, DW_AT_decl_column(0x02)
    6122                    
    6123                    
    6124                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    6125                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x04)
    6126                    $C$DW$590       .dwtag  DW_TAG_member
    6127                            .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$13)
    6128                            .dwattr $C$DW$590, DW_AT_name("Operation")
    6129                            .dwattr $C$DW$590, DW_AT_TI_symbol_name("Operation")
    6130                            .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6131                            .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    6132                            .dwattr $C$DW$590, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6133                            .dwattr $C$DW$590, DW_AT_decl_line(0xca)
    6134                            .dwattr $C$DW$590, DW_AT_decl_column(0x08)
    6135                    
    6136                            .dwattr $C$DW$T$34, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6137                            .dwattr $C$DW$T$34, DW_AT_decl_line(0xc9)
    6138                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x01)
    6139                            .dwendtag $C$DW$T$34
    6140                    
    6141                    $C$DW$T$454     .dwtag  DW_TAG_typedef
    6142                            .dwattr $C$DW$T$454, DW_AT_name("SlFsRetToFactoryCommand_t")
    6143                            .dwattr $C$DW$T$454, DW_AT_type(*$C$DW$T$34)
    6144                            .dwattr $C$DW$T$454, DW_AT_language(DW_LANG_C)
    6145                            .dwattr $C$DW$T$454, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h"
    6146                            .dwattr $C$DW$T$454, DW_AT_decl_line(0xcb)
    6147                            .dwattr $C$DW$T$454, DW_AT_decl_column(0x02)
    6148                    
    6149                    
    6150                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    6151                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x04)
    6152                    $C$DW$591       .dwtag  DW_TAG_member
    6153                            .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$13)
    6154                            .dwattr $C$DW$591, DW_AT_name("IncludeFilters")
    6155                            .dwattr $C$DW$591, DW_AT_TI_symbol_name("IncludeFilters")
    6156                            .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler Unix v16.9.6 Thu Dec 28 17:45:45 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  113

    6157                            .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    6158                            .dwattr $C$DW$591, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6159                            .dwattr $C$DW$591, DW_AT_decl_line(0xd1)
    6160                            .dwattr $C$DW$591, DW_AT_decl_column(0x12)
    6161                    
    6162                            .dwattr $C$DW$T$35, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6163                            .dwattr $C$DW$T$35, DW_AT_decl_line(0xd0)
    6164                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x01)
    6165                            .dwendtag $C$DW$T$35
    6166                    
    6167                    $C$DW$T$455     .dwtag  DW_TAG_typedef
    6168                            .dwattr $C$DW$T$455, DW_AT_name("SlFsControl_t")
    6169                            .dwattr $C$DW$T$455, DW_AT_type(*$C$DW$T$35)
    6170                            .dwattr $C$DW$T$455, DW_AT_language(DW_LANG_C)
    6171                            .dwattr $C$DW$T$455, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h"
    6172                            .dwattr $C$DW$T$455, DW_AT_decl_line(0xd3)
    6173                            .dwattr $C$DW$T$455, DW_AT_decl_column(0x02)
    6174                    
    6175                    
    6176                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    6177                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x10)
    6178                    $C$DW$592       .dwtag  DW_TAG_member
    6179                            .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$9)
    6180                            .dwattr $C$DW$592, DW_AT_name("DeviceBlockSize")
    6181                            .dwattr $C$DW$592, DW_AT_TI_symbol_name("DeviceBlockSize")
    6182                            .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6183                            .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    6184                            .dwattr $C$DW$592, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6185                            .dwattr $C$DW$592, DW_AT_decl_line(0xd7)
    6186                            .dwattr $C$DW$592, DW_AT_decl_column(0x08)
    6187                    
    6188                    $C$DW$593       .dwtag  DW_TAG_member
    6189                            .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$9)
    6190                            .dwattr $C$DW$593, DW_AT_name("DeviceBlocksCapacity")
    6191                            .dwattr $C$DW$593, DW_AT_TI_symbol_name("DeviceBlocksCapacity")
    6192                            .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6193                            .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    6194                            .dwattr $C$DW$593, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6195                            .dwattr $C$DW$593, DW_AT_decl_line(0xd8)
    6196                            .dwattr $C$DW$593, DW_AT_decl_column(0x08)
    6197                    
    6198                    $C$DW$594       .dwtag  DW_TAG_member
    6199                            .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$9)
    6200                            .dwattr $C$DW$594, DW_AT_name("NumOfAllocatedBlocks")
    6201                            .dwattr $C$DW$594, DW_AT_TI_symbol_name("NumOfAllocatedBlocks")
    6202                            .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6203                            .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    6204                            .dwattr $C$DW$594, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6205                            .dwattr $C$DW$594, DW_AT_decl_line(0xd9)
    6206                            .dwattr $C$DW$594, DW_AT_decl_column(0x08)
    6207                    
    6208                    $C$DW$595       .dwtag  DW_TAG_member
    6209                            .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$9)
    6210                            .dwattr $C$DW$595, DW_AT_name("NumOfReservedBlocks")
    6211                            .dwattr $C$DW$595, DW_AT_TI_symbol_name("NumOfReservedBlocks")
TI ARM Assembler Unix v16.9.6 Thu Dec 28 17:45:45 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  114

    6212                            .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6213                            .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    6214                            .dwattr $C$DW$595, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6215                            .dwattr $C$DW$595, DW_AT_decl_line(0xda)
    6216                            .dwattr $C$DW$595, DW_AT_decl_column(0x08)
    6217                    
    6218                    $C$DW$596       .dwtag  DW_TAG_member
    6219                            .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$9)
    6220                            .dwattr $C$DW$596, DW_AT_name("NumOfReservedBlocksForSystemfiles")
    6221                            .dwattr $C$DW$596, DW_AT_TI_symbol_name("NumOfReservedBlocksForSystemfiles")
    6222                            .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6223                            .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    6224                            .dwattr $C$DW$596, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6225                            .dwattr $C$DW$596, DW_AT_decl_line(0xdb)
    6226                            .dwattr $C$DW$596, DW_AT_decl_column(0x08)
    6227                    
    6228                    $C$DW$597       .dwtag  DW_TAG_member
    6229                            .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$9)
    6230                            .dwattr $C$DW$597, DW_AT_name("LargestAllocatedGapInBlocks")
    6231                            .dwattr $C$DW$597, DW_AT_TI_symbol_name("LargestAllocatedGapInBlocks")
    6232                            .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6233                            .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    6234                            .dwattr $C$DW$597, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6235                            .dwattr $C$DW$597, DW_AT_decl_line(0xdc)
    6236                            .dwattr $C$DW$597, DW_AT_decl_column(0x08)
    6237                    
    6238                    $C$DW$598       .dwtag  DW_TAG_member
    6239                            .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$9)
    6240                            .dwattr $C$DW$598, DW_AT_name("NumOfAvailableBlocksForUserFiles")
    6241                            .dwattr $C$DW$598, DW_AT_TI_symbol_name("NumOfAvailableBlocksForUserFiles")
    6242                            .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6243                            .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    6244                            .dwattr $C$DW$598, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6245                            .dwattr $C$DW$598, DW_AT_decl_line(0xdd)
    6246                            .dwattr $C$DW$598, DW_AT_decl_column(0x08)
    6247                    
    6248                    $C$DW$599       .dwtag  DW_TAG_member
    6249                            .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$36)
    6250                            .dwattr $C$DW$599, DW_AT_name("Padding")
    6251                            .dwattr $C$DW$599, DW_AT_TI_symbol_name("Padding")
    6252                            .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6253                            .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    6254                            .dwattr $C$DW$599, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6255                            .dwattr $C$DW$599, DW_AT_decl_line(0xde)
    6256                            .dwattr $C$DW$599, DW_AT_decl_column(0x08)
    6257                    
    6258                            .dwattr $C$DW$T$37, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6259                            .dwattr $C$DW$T$37, DW_AT_decl_line(0xd6)
    6260                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
    6261                            .dwendtag $C$DW$T$37
    6262                    
    6263                    $C$DW$T$39      .dwtag  DW_TAG_typedef
    6264                            .dwattr $C$DW$T$39, DW_AT_name("SlFsControlDeviceUsage_t")
    6265                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$37)
    6266                            .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
TI ARM Assembler Unix v16.9.6 Thu Dec 28 17:45:45 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  115

    6267                            .dwattr $C$DW$T$39, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6268                            .dwattr $C$DW$T$39, DW_AT_decl_line(0xdf)
    6269                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x03)
    6270                    
    6271                    
    6272                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    6273                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x14)
    6274                    $C$DW$600       .dwtag  DW_TAG_member
    6275                            .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$6)
    6276                            .dwattr $C$DW$600, DW_AT_name("MaxFsFiles")
    6277                            .dwattr $C$DW$600, DW_AT_TI_symbol_name("MaxFsFiles")
    6278                            .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6279                            .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    6280                            .dwattr $C$DW$600, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6281                            .dwattr $C$DW$600, DW_AT_decl_line(0xe3)
    6282                            .dwattr $C$DW$600, DW_AT_decl_column(0x08)
    6283                    
    6284                    $C$DW$601       .dwtag  DW_TAG_member
    6285                            .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$6)
    6286                            .dwattr $C$DW$601, DW_AT_name("IsDevlopmentFormatType")
    6287                            .dwattr $C$DW$601, DW_AT_TI_symbol_name("IsDevlopmentFormatType")
    6288                            .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6289                            .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    6290                            .dwattr $C$DW$601, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6291                            .dwattr $C$DW$601, DW_AT_decl_line(0xe4)
    6292                            .dwattr $C$DW$601, DW_AT_decl_column(0x08)
    6293                    
    6294                    $C$DW$602       .dwtag  DW_TAG_member
    6295                            .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$6)
    6296                            .dwattr $C$DW$602, DW_AT_name("Bundlestate")
    6297                            .dwattr $C$DW$602, DW_AT_TI_symbol_name("Bundlestate")
    6298                            .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6299                            .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    6300                            .dwattr $C$DW$602, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6301                            .dwattr $C$DW$602, DW_AT_decl_line(0xe5)
    6302                            .dwattr $C$DW$602, DW_AT_decl_column(0x08)
    6303                    
    6304                    $C$DW$603       .dwtag  DW_TAG_member
    6305                            .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$6)
    6306                            .dwattr $C$DW$603, DW_AT_name("Reserved")
    6307                            .dwattr $C$DW$603, DW_AT_TI_symbol_name("Reserved")
    6308                            .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6309                            .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    6310                            .dwattr $C$DW$603, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6311                            .dwattr $C$DW$603, DW_AT_decl_line(0xe6)
    6312                            .dwattr $C$DW$603, DW_AT_decl_column(0x08)
    6313                    
    6314                    $C$DW$604       .dwtag  DW_TAG_member
    6315                            .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$6)
    6316                            .dwattr $C$DW$604, DW_AT_name("MaxFsFilesReservedForSysFiles")
    6317                            .dwattr $C$DW$604, DW_AT_TI_symbol_name("MaxFsFilesReservedForSysFiles")
    6318                            .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6319                            .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    6320                            .dwattr $C$DW$604, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6321                            .dwattr $C$DW$604, DW_AT_decl_line(0xe7)
TI ARM Assembler Unix v16.9.6 Thu Dec 28 17:45:45 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  116

    6322                            .dwattr $C$DW$604, DW_AT_decl_column(0x08)
    6323                    
    6324                    $C$DW$605       .dwtag  DW_TAG_member
    6325                            .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$6)
    6326                            .dwattr $C$DW$605, DW_AT_name("ActualNumOfUserFiles")
    6327                            .dwattr $C$DW$605, DW_AT_TI_symbol_name("ActualNumOfUserFiles")
    6328                            .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6329                            .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    6330                            .dwattr $C$DW$605, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6331                            .dwattr $C$DW$605, DW_AT_decl_line(0xe8)
    6332                            .dwattr $C$DW$605, DW_AT_decl_column(0x08)
    6333                    
    6334                    $C$DW$606       .dwtag  DW_TAG_member
    6335                            .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$6)
    6336                            .dwattr $C$DW$606, DW_AT_name("ActualNumOfSysFiles")
    6337                            .dwattr $C$DW$606, DW_AT_TI_symbol_name("ActualNumOfSysFiles")
    6338                            .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6339                            .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    6340                            .dwattr $C$DW$606, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6341                            .dwattr $C$DW$606, DW_AT_decl_line(0xe9)
    6342                            .dwattr $C$DW$606, DW_AT_decl_column(0x08)
    6343                    
    6344                    $C$DW$607       .dwtag  DW_TAG_member
    6345                            .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$6)
    6346                            .dwattr $C$DW$607, DW_AT_name("Padding")
    6347                            .dwattr $C$DW$607, DW_AT_TI_symbol_name("Padding")
    6348                            .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6349                            .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    6350                            .dwattr $C$DW$607, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6351                            .dwattr $C$DW$607, DW_AT_decl_line(0xea)
    6352                            .dwattr $C$DW$607, DW_AT_decl_column(0x08)
    6353                    
    6354                    $C$DW$608       .dwtag  DW_TAG_member
    6355                            .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$13)
    6356                            .dwattr $C$DW$608, DW_AT_name("NumOfAlerts")
    6357                            .dwattr $C$DW$608, DW_AT_TI_symbol_name("NumOfAlerts")
    6358                            .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6359                            .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    6360                            .dwattr $C$DW$608, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6361                            .dwattr $C$DW$608, DW_AT_decl_line(0xeb)
    6362                            .dwattr $C$DW$608, DW_AT_decl_column(0x08)
    6363                    
    6364                    $C$DW$609       .dwtag  DW_TAG_member
    6365                            .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$13)
    6366                            .dwattr $C$DW$609, DW_AT_name("NumOfAlertsThreshold")
    6367                            .dwattr $C$DW$609, DW_AT_TI_symbol_name("NumOfAlertsThreshold")
    6368                            .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6369                            .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    6370                            .dwattr $C$DW$609, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6371                            .dwattr $C$DW$609, DW_AT_decl_line(0xec)
    6372                            .dwattr $C$DW$609, DW_AT_decl_column(0x08)
    6373                    
    6374                    $C$DW$610       .dwtag  DW_TAG_member
    6375                            .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$9)
    6376                            .dwattr $C$DW$610, DW_AT_name("FATWriteCounter")
TI ARM Assembler Unix v16.9.6 Thu Dec 28 17:45:45 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  117

    6377                            .dwattr $C$DW$610, DW_AT_TI_symbol_name("FATWriteCounter")
    6378                            .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6379                            .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    6380                            .dwattr $C$DW$610, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6381                            .dwattr $C$DW$610, DW_AT_decl_line(0xed)
    6382                            .dwattr $C$DW$610, DW_AT_decl_column(0x08)
    6383                    
    6384                    $C$DW$611       .dwtag  DW_TAG_member
    6385                            .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$9)
    6386                            .dwattr $C$DW$611, DW_AT_name("Padding2")
    6387                            .dwattr $C$DW$611, DW_AT_TI_symbol_name("Padding2")
    6388                            .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6389                            .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    6390                            .dwattr $C$DW$611, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6391                            .dwattr $C$DW$611, DW_AT_decl_line(0xee)
    6392                            .dwattr $C$DW$611, DW_AT_decl_column(0x08)
    6393                    
    6394                            .dwattr $C$DW$T$38, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6395                            .dwattr $C$DW$T$38, DW_AT_decl_line(0xe2)
    6396                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x01)
    6397                            .dwendtag $C$DW$T$38
    6398                    
    6399                    $C$DW$T$40      .dwtag  DW_TAG_typedef
    6400                            .dwattr $C$DW$T$40, DW_AT_name("SlFsControlFilesUsage_t")
    6401                            .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$38)
    6402                            .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    6403                            .dwattr $C$DW$T$40, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6404                            .dwattr $C$DW$T$40, DW_AT_decl_line(0xef)
    6405                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x02)
    6406                    
    6407                    
    6408                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    6409                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x24)
    6410                    $C$DW$612       .dwtag  DW_TAG_member
    6411                            .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$39)
    6412                            .dwattr $C$DW$612, DW_AT_name("DeviceUsage")
    6413                            .dwattr $C$DW$612, DW_AT_TI_symbol_name("DeviceUsage")
    6414                            .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6415                            .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    6416                            .dwattr $C$DW$612, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6417                            .dwattr $C$DW$612, DW_AT_decl_line(0xf4)
    6418                            .dwattr $C$DW$612, DW_AT_decl_column(0x1e)
    6419                    
    6420                    $C$DW$613       .dwtag  DW_TAG_member
    6421                            .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$40)
    6422                            .dwattr $C$DW$613, DW_AT_name("FilesUsage")
    6423                            .dwattr $C$DW$613, DW_AT_TI_symbol_name("FilesUsage")
    6424                            .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6425                            .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    6426                            .dwattr $C$DW$613, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6427                            .dwattr $C$DW$613, DW_AT_decl_line(0xf5)
    6428                            .dwattr $C$DW$613, DW_AT_decl_column(0x1e)
    6429                    
    6430                            .dwattr $C$DW$T$41, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6431                            .dwattr $C$DW$T$41, DW_AT_decl_line(0xf3)
TI ARM Assembler Unix v16.9.6 Thu Dec 28 17:45:45 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  118

    6432                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    6433                            .dwendtag $C$DW$T$41
    6434                    
    6435                    $C$DW$T$456     .dwtag  DW_TAG_typedef
    6436                            .dwattr $C$DW$T$456, DW_AT_name("SlFsControlGetStorageInfoResponse_t")
    6437                            .dwattr $C$DW$T$456, DW_AT_type(*$C$DW$T$41)
    6438                            .dwattr $C$DW$T$456, DW_AT_language(DW_LANG_C)
    6439                            .dwattr $C$DW$T$456, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h"
    6440                            .dwattr $C$DW$T$456, DW_AT_decl_line(0xf6)
    6441                            .dwattr $C$DW$T$456, DW_AT_decl_column(0x03)
    6442                    
    6443                    
    6444                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    6445                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x0c)
    6446                    $C$DW$614       .dwtag  DW_TAG_member
    6447                            .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$13)
    6448                            .dwattr $C$DW$614, DW_AT_name("IncludeFilters")
    6449                            .dwattr $C$DW$614, DW_AT_TI_symbol_name("IncludeFilters")
    6450                            .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6451                            .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    6452                            .dwattr $C$DW$614, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6453                            .dwattr $C$DW$614, DW_AT_decl_line(0xfa)
    6454                            .dwattr $C$DW$614, DW_AT_decl_column(0x0b)
    6455                    
    6456                    $C$DW$615       .dwtag  DW_TAG_member
    6457                            .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$6)
    6458                            .dwattr $C$DW$615, DW_AT_name("OpenedForWriteCnt")
    6459                            .dwattr $C$DW$615, DW_AT_TI_symbol_name("OpenedForWriteCnt")
    6460                            .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6461                            .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    6462                            .dwattr $C$DW$615, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6463                            .dwattr $C$DW$615, DW_AT_decl_line(0xfb)
    6464                            .dwattr $C$DW$615, DW_AT_decl_column(0x0b)
    6465                    
    6466                    $C$DW$616       .dwtag  DW_TAG_member
    6467                            .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$6)
    6468                            .dwattr $C$DW$616, DW_AT_name("OpeneForReadCnt")
    6469                            .dwattr $C$DW$616, DW_AT_TI_symbol_name("OpeneForReadCnt")
    6470                            .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6471                            .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    6472                            .dwattr $C$DW$616, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6473                            .dwattr $C$DW$616, DW_AT_decl_line(0xfc)
    6474                            .dwattr $C$DW$616, DW_AT_decl_column(0x0b)
    6475                    
    6476                    $C$DW$617       .dwtag  DW_TAG_member
    6477                            .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$6)
    6478                            .dwattr $C$DW$617, DW_AT_name("ClosedFilesCnt")
    6479                            .dwattr $C$DW$617, DW_AT_TI_symbol_name("ClosedFilesCnt")
    6480                            .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6481                            .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    6482                            .dwattr $C$DW$617, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6483                            .dwattr $C$DW$617, DW_AT_decl_line(0xfd)
    6484                            .dwattr $C$DW$617, DW_AT_decl_column(0x0b)
    6485                    
    6486                    $C$DW$618       .dwtag  DW_TAG_member
TI ARM Assembler Unix v16.9.6 Thu Dec 28 17:45:45 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  119

    6487                            .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$6)
    6488                            .dwattr $C$DW$618, DW_AT_name("OpenedForWriteCntWithValidFailSafeImage")
    6489                            .dwattr $C$DW$618, DW_AT_TI_symbol_name("OpenedForWriteCntWithValidFailSafeImage")
    6490                            .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6491                            .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    6492                            .dwattr $C$DW$618, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6493                            .dwattr $C$DW$618, DW_AT_decl_line(0xfe)
    6494                            .dwattr $C$DW$618, DW_AT_decl_column(0x0b)
    6495                    
    6496                    $C$DW$619       .dwtag  DW_TAG_member
    6497                            .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$6)
    6498                            .dwattr $C$DW$619, DW_AT_name("OpeneForReadCntWithValidFailSafeImage")
    6499                            .dwattr $C$DW$619, DW_AT_TI_symbol_name("OpeneForReadCntWithValidFailSafeImage")
    6500                            .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6501                            .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    6502                            .dwattr $C$DW$619, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6503                            .dwattr $C$DW$619, DW_AT_decl_line(0xff)
    6504                            .dwattr $C$DW$619, DW_AT_decl_column(0x0b)
    6505                    
    6506                    $C$DW$620       .dwtag  DW_TAG_member
    6507                            .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$6)
    6508                            .dwattr $C$DW$620, DW_AT_name("ClosedFilesCntWithValidFailSafeImage")
    6509                            .dwattr $C$DW$620, DW_AT_TI_symbol_name("ClosedFilesCntWithValidFailSafeImage")
    6510                            .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6511                            .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    6512                            .dwattr $C$DW$620, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6513                            .dwattr $C$DW$620, DW_AT_decl_line(0x100)
    6514                            .dwattr $C$DW$620, DW_AT_decl_column(0x0b)
    6515                    
    6516                    $C$DW$621       .dwtag  DW_TAG_member
    6517                            .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$36)
    6518                            .dwattr $C$DW$621, DW_AT_name("padding")
    6519                            .dwattr $C$DW$621, DW_AT_TI_symbol_name("padding")
    6520                            .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6521                            .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    6522                            .dwattr $C$DW$621, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6523                            .dwattr $C$DW$621, DW_AT_decl_line(0x101)
    6524                            .dwattr $C$DW$621, DW_AT_decl_column(0x0b)
    6525                    
    6526                            .dwattr $C$DW$T$42, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6527                            .dwattr $C$DW$T$42, DW_AT_decl_line(0xf9)
    6528                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x01)
    6529                            .dwendtag $C$DW$T$42
    6530                    
    6531                    $C$DW$T$457     .dwtag  DW_TAG_typedef
    6532                            .dwattr $C$DW$T$457, DW_AT_name("SlFsControlGetCountersResponse_t")
    6533                            .dwattr $C$DW$T$457, DW_AT_type(*$C$DW$T$42)
    6534                            .dwattr $C$DW$T$457, DW_AT_language(DW_LANG_C)
    6535                            .dwattr $C$DW$T$457, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h"
    6536                            .dwattr $C$DW$T$457, DW_AT_decl_line(0x102)
    6537                            .dwattr $C$DW$T$457, DW_AT_decl_column(0x03)
    6538                    
    6539                    
    6540                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    6541                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x0c)
TI ARM Assembler Unix v16.9.6 Thu Dec 28 17:45:45 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  120

    6542                    $C$DW$622       .dwtag  DW_TAG_member
    6543                            .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$13)
    6544                            .dwattr $C$DW$622, DW_AT_name("FileMaxSize")
    6545                            .dwattr $C$DW$622, DW_AT_TI_symbol_name("FileMaxSize")
    6546                            .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6547                            .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    6548                            .dwattr $C$DW$622, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6549                            .dwattr $C$DW$622, DW_AT_decl_line(0x111)
    6550                            .dwattr $C$DW$622, DW_AT_decl_column(0x0a)
    6551                    
    6552                    $C$DW$623       .dwtag  DW_TAG_member
    6553                            .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$13)
    6554                            .dwattr $C$DW$623, DW_AT_name("Properties")
    6555                            .dwattr $C$DW$623, DW_AT_TI_symbol_name("Properties")
    6556                            .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6557                            .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    6558                            .dwattr $C$DW$623, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6559                            .dwattr $C$DW$623, DW_AT_decl_line(0x112)
    6560                            .dwattr $C$DW$623, DW_AT_decl_column(0x0a)
    6561                    
    6562                    $C$DW$624       .dwtag  DW_TAG_member
    6563                            .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$13)
    6564                            .dwattr $C$DW$624, DW_AT_name("FileAllocatedBlocks")
    6565                            .dwattr $C$DW$624, DW_AT_TI_symbol_name("FileAllocatedBlocks")
    6566                            .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6567                            .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    6568                            .dwattr $C$DW$624, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6569                            .dwattr $C$DW$624, DW_AT_decl_line(0x113)
    6570                            .dwattr $C$DW$624, DW_AT_decl_column(0x0a)
    6571                    
    6572                            .dwattr $C$DW$T$43, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h")
    6573                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x110)
    6574                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x01)
    6575                            .dwendtag $C$DW$T$43
    6576                    
    6577                    $C$DW$T$458     .dwtag  DW_TAG_typedef
    6578                            .dwattr $C$DW$T$458, DW_AT_name("SlFileAttributes_t")
    6579                            .dwattr $C$DW$T$458, DW_AT_type(*$C$DW$T$43)
    6580                            .dwattr $C$DW$T$458, DW_AT_language(DW_LANG_C)
    6581                            .dwattr $C$DW$T$458, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/fs.h"
    6582                            .dwattr $C$DW$T$458, DW_AT_decl_line(0x114)
    6583                            .dwattr $C$DW$T$458, DW_AT_decl_column(0x02)
    6584                    
    6585                    
    6586                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    6587                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x04)
    6588                    $C$DW$625       .dwtag  DW_TAG_member
    6589                            .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$13)
    6590                            .dwattr $C$DW$625, DW_AT_name("KeepaliveEnabled")
    6591                            .dwattr $C$DW$625, DW_AT_TI_symbol_name("KeepaliveEnabled")
    6592                            .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6593                            .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    6594                            .dwattr $C$DW$625, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_sock
    6595                            .dwattr $C$DW$625, DW_AT_decl_line(0xf6)
    6596                            .dwattr $C$DW$625, DW_AT_decl_column(0x0a)
TI ARM Assembler Unix v16.9.6 Thu Dec 28 17:45:45 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  121

    6597                    
    6598                            .dwattr $C$DW$T$44, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_soc
    6599                            .dwattr $C$DW$T$44, DW_AT_decl_line(0xf5)
    6600                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
    6601                            .dwendtag $C$DW$T$44
    6602                    
    6603                    $C$DW$T$459     .dwtag  DW_TAG_typedef
    6604                            .dwattr $C$DW$T$459, DW_AT_name("SlSockKeepalive_t")
    6605                            .dwattr $C$DW$T$459, DW_AT_type(*$C$DW$T$44)
    6606                            .dwattr $C$DW$T$459, DW_AT_language(DW_LANG_C)
    6607                            .dwattr $C$DW$T$459, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_so
    6608                            .dwattr $C$DW$T$459, DW_AT_decl_line(0xf7)
    6609                            .dwattr $C$DW$T$459, DW_AT_decl_column(0x02)
    6610                    
    6611                    
    6612                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    6613                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x04)
    6614                    $C$DW$626       .dwtag  DW_TAG_member
    6615                            .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$13)
    6616                            .dwattr $C$DW$626, DW_AT_name("ReuseaddrEnabled")
    6617                            .dwattr $C$DW$626, DW_AT_TI_symbol_name("ReuseaddrEnabled")
    6618                            .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6619                            .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    6620                            .dwattr $C$DW$626, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_sock
    6621                            .dwattr $C$DW$626, DW_AT_decl_line(0xfb)
    6622                            .dwattr $C$DW$626, DW_AT_decl_column(0x0a)
    6623                    
    6624                            .dwattr $C$DW$T$45, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_soc
    6625                            .dwattr $C$DW$T$45, DW_AT_decl_line(0xfa)
    6626                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x01)
    6627                            .dwendtag $C$DW$T$45
    6628                    
    6629                    $C$DW$T$460     .dwtag  DW_TAG_typedef
    6630                            .dwattr $C$DW$T$460, DW_AT_name("SlSockReuseaddr_t")
    6631                            .dwattr $C$DW$T$460, DW_AT_type(*$C$DW$T$45)
    6632                            .dwattr $C$DW$T$460, DW_AT_language(DW_LANG_C)
    6633                            .dwattr $C$DW$T$460, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_so
    6634                            .dwattr $C$DW$T$460, DW_AT_decl_line(0xfc)
    6635                            .dwattr $C$DW$T$460, DW_AT_decl_column(0x02)
    6636                    
    6637                    
    6638                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    6639                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x04)
    6640                    $C$DW$627       .dwtag  DW_TAG_member
    6641                            .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$12)
    6642                            .dwattr $C$DW$627, DW_AT_name("RxIpNoBoundaryEnabled")
    6643                            .dwattr $C$DW$627, DW_AT_TI_symbol_name("RxIpNoBoundaryEnabled")
    6644                            .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6645                            .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    6646                            .dwattr $C$DW$627, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_sock
    6647                            .dwattr $C$DW$627, DW_AT_decl_line(0x100)
    6648                            .dwattr $C$DW$627, DW_AT_decl_column(0x0a)
    6649                    
    6650                            .dwattr $C$DW$T$46, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_soc
    6651                            .dwattr $C$DW$T$46, DW_AT_decl_line(0xff)
TI ARM Assembler Unix v16.9.6 Thu Dec 28 17:45:45 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  122

    6652                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x01)
    6653                            .dwendtag $C$DW$T$46
    6654                    
    6655                    $C$DW$T$461     .dwtag  DW_TAG_typedef
    6656                            .dwattr $C$DW$T$461, DW_AT_name("SlSockRxNoIpBoundary_t")
    6657                            .dwattr $C$DW$T$461, DW_AT_type(*$C$DW$T$46)
    6658                            .dwattr $C$DW$T$461, DW_AT_language(DW_LANG_C)
    6659                            .dwattr $C$DW$T$461, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_so
    6660                            .dwattr $C$DW$T$461, DW_AT_decl_line(0x101)
    6661                            .dwattr $C$DW$T$461, DW_AT_decl_column(0x03)
    6662                    
    6663                    
    6664                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    6665                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x04)
    6666                    $C$DW$628       .dwtag  DW_TAG_member
    6667                            .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$13)
    6668                            .dwattr $C$DW$628, DW_AT_name("WinSize")
    6669                            .dwattr $C$DW$628, DW_AT_TI_symbol_name("WinSize")
    6670                            .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6671                            .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    6672                            .dwattr $C$DW$628, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_sock
    6673                            .dwattr $C$DW$628, DW_AT_decl_line(0x105)
    6674                            .dwattr $C$DW$628, DW_AT_decl_column(0x0a)
    6675                    
    6676                            .dwattr $C$DW$T$47, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_soc
    6677                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x104)
    6678                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x01)
    6679                            .dwendtag $C$DW$T$47
    6680                    
    6681                    $C$DW$T$462     .dwtag  DW_TAG_typedef
    6682                            .dwattr $C$DW$T$462, DW_AT_name("SlSockWinsize_t")
    6683                            .dwattr $C$DW$T$462, DW_AT_type(*$C$DW$T$47)
    6684                            .dwattr $C$DW$T$462, DW_AT_language(DW_LANG_C)
    6685                            .dwattr $C$DW$T$462, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_so
    6686                            .dwattr $C$DW$T$462, DW_AT_decl_line(0x106)
    6687                            .dwattr $C$DW$T$462, DW_AT_decl_column(0x02)
    6688                    
    6689                    
    6690                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    6691                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x04)
    6692                    $C$DW$629       .dwtag  DW_TAG_member
    6693                            .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$13)
    6694                            .dwattr $C$DW$629, DW_AT_name("NonBlockingEnabled")
    6695                            .dwattr $C$DW$629, DW_AT_TI_symbol_name("NonBlockingEnabled")
    6696                            .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6697                            .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    6698                            .dwattr $C$DW$629, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_sock
    6699                            .dwattr $C$DW$629, DW_AT_decl_line(0x10a)
    6700                            .dwattr $C$DW$629, DW_AT_decl_column(0x0a)
    6701                    
    6702                            .dwattr $C$DW$T$48, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_soc
    6703                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x109)
    6704                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x01)
    6705                            .dwendtag $C$DW$T$48
    6706                    
TI ARM Assembler Unix v16.9.6 Thu Dec 28 17:45:45 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  123

    6707                    $C$DW$T$463     .dwtag  DW_TAG_typedef
    6708                            .dwattr $C$DW$T$463, DW_AT_name("SlSockNonblocking_t")
    6709                            .dwattr $C$DW$T$463, DW_AT_type(*$C$DW$T$48)
    6710                            .dwattr $C$DW$T$463, DW_AT_language(DW_LANG_C)
    6711                            .dwattr $C$DW$T$463, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_so
    6712                            .dwattr $C$DW$T$463, DW_AT_decl_line(0x10b)
    6713                            .dwattr $C$DW$T$463, DW_AT_decl_column(0x02)
    6714                    
    6715                    
    6716                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    6717                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x84)
    6718                    $C$DW$630       .dwtag  DW_TAG_member
    6719                            .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$6)
    6720                            .dwattr $C$DW$630, DW_AT_name("Sd")
    6721                            .dwattr $C$DW$630, DW_AT_TI_symbol_name("Sd")
    6722                            .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6723                            .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    6724                            .dwattr $C$DW$630, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_sock
    6725                            .dwattr $C$DW$630, DW_AT_decl_line(0x10f)
    6726                            .dwattr $C$DW$630, DW_AT_decl_column(0x0b)
    6727                    
    6728                    $C$DW$631       .dwtag  DW_TAG_member
    6729                            .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$6)
    6730                            .dwattr $C$DW$631, DW_AT_name("Type")
    6731                            .dwattr $C$DW$631, DW_AT_TI_symbol_name("Type")
    6732                            .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6733                            .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    6734                            .dwattr $C$DW$631, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_sock
    6735                            .dwattr $C$DW$631, DW_AT_decl_line(0x110)
    6736                            .dwattr $C$DW$631, DW_AT_decl_column(0x0b)
    6737                    
    6738                    $C$DW$632       .dwtag  DW_TAG_member
    6739                            .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$8)
    6740                            .dwattr $C$DW$632, DW_AT_name("Val")
    6741                            .dwattr $C$DW$632, DW_AT_TI_symbol_name("Val")
    6742                            .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6743                            .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    6744                            .dwattr $C$DW$632, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_sock
    6745                            .dwattr $C$DW$632, DW_AT_decl_line(0x111)
    6746                            .dwattr $C$DW$632, DW_AT_decl_column(0x0b)
    6747                    
    6748                    $C$DW$633       .dwtag  DW_TAG_member
    6749                            .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$49)
    6750                            .dwattr $C$DW$633, DW_AT_name("pExtraInfo")
    6751                            .dwattr $C$DW$633, DW_AT_TI_symbol_name("pExtraInfo")
    6752                            .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6753                            .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    6754                            .dwattr $C$DW$633, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_sock
    6755                            .dwattr $C$DW$633, DW_AT_decl_line(0x112)
    6756                            .dwattr $C$DW$633, DW_AT_decl_column(0x0b)
    6757                    
    6758                            .dwattr $C$DW$T$50, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_soc
    6759                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x10e)
    6760                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
    6761                            .dwendtag $C$DW$T$50
TI ARM Assembler Unix v16.9.6 Thu Dec 28 17:45:45 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  124

    6762                    
    6763                    $C$DW$T$211     .dwtag  DW_TAG_typedef
    6764                            .dwattr $C$DW$T$211, DW_AT_name("SlSocketAsyncEvent_t")
    6765                            .dwattr $C$DW$T$211, DW_AT_type(*$C$DW$T$50)
    6766                            .dwattr $C$DW$T$211, DW_AT_language(DW_LANG_C)
    6767                            .dwattr $C$DW$T$211, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_so
    6768                            .dwattr $C$DW$T$211, DW_AT_decl_line(0x113)
    6769                            .dwattr $C$DW$T$211, DW_AT_decl_column(0x03)
    6770                    
    6771                    
    6772                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
    6773                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x04)
    6774                    $C$DW$634       .dwtag  DW_TAG_member
    6775                            .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$8)
    6776                            .dwattr $C$DW$634, DW_AT_name("Status")
    6777                            .dwattr $C$DW$634, DW_AT_TI_symbol_name("Status")
    6778                            .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6779                            .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    6780                            .dwattr $C$DW$634, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_sock
    6781                            .dwattr $C$DW$634, DW_AT_decl_line(0x117)
    6782                            .dwattr $C$DW$634, DW_AT_decl_column(0x10)
    6783                    
    6784                    $C$DW$635       .dwtag  DW_TAG_member
    6785                            .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$6)
    6786                            .dwattr $C$DW$635, DW_AT_name("Sd")
    6787                            .dwattr $C$DW$635, DW_AT_TI_symbol_name("Sd")
    6788                            .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6789                            .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    6790                            .dwattr $C$DW$635, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_sock
    6791                            .dwattr $C$DW$635, DW_AT_decl_line(0x118)
    6792                            .dwattr $C$DW$635, DW_AT_decl_column(0x10)
    6793                    
    6794                    $C$DW$636       .dwtag  DW_TAG_member
    6795                            .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$6)
    6796                            .dwattr $C$DW$636, DW_AT_name("Padding")
    6797                            .dwattr $C$DW$636, DW_AT_TI_symbol_name("Padding")
    6798                            .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6799                            .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    6800                            .dwattr $C$DW$636, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_sock
    6801                            .dwattr $C$DW$636, DW_AT_decl_line(0x119)
    6802                            .dwattr $C$DW$636, DW_AT_decl_column(0x10)
    6803                    
    6804                            .dwattr $C$DW$T$51, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_soc
    6805                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x116)
    6806                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x01)
    6807                            .dwendtag $C$DW$T$51
    6808                    
    6809                    $C$DW$T$210     .dwtag  DW_TAG_typedef
    6810                            .dwattr $C$DW$T$210, DW_AT_name("SlSockTxFailEventData_t")
    6811                            .dwattr $C$DW$T$210, DW_AT_type(*$C$DW$T$51)
    6812                            .dwattr $C$DW$T$210, DW_AT_language(DW_LANG_C)
    6813                            .dwattr $C$DW$T$210, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_so
    6814                            .dwattr $C$DW$T$210, DW_AT_decl_line(0x11a)
    6815                            .dwattr $C$DW$T$210, DW_AT_decl_column(0x03)
    6816                    
TI ARM Assembler Unix v16.9.6 Thu Dec 28 17:45:45 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  125

    6817                    
    6818                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
    6819                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x88)
    6820                    $C$DW$637       .dwtag  DW_TAG_member
    6821                            .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$13)
    6822                            .dwattr $C$DW$637, DW_AT_name("Event")
    6823                            .dwattr $C$DW$637, DW_AT_TI_symbol_name("Event")
    6824                            .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6825                            .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    6826                            .dwattr $C$DW$637, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_sock
    6827                            .dwattr $C$DW$637, DW_AT_decl_line(0x126)
    6828                            .dwattr $C$DW$637, DW_AT_decl_column(0x1c)
    6829                    
    6830                    $C$DW$638       .dwtag  DW_TAG_member
    6831                            .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$52)
    6832                            .dwattr $C$DW$638, DW_AT_name("SocketAsyncEvent")
    6833                            .dwattr $C$DW$638, DW_AT_TI_symbol_name("SocketAsyncEvent")
    6834                            .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6835                            .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    6836                            .dwattr $C$DW$638, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_sock
    6837                            .dwattr $C$DW$638, DW_AT_decl_line(0x127)
    6838                            .dwattr $C$DW$638, DW_AT_decl_column(0x1c)
    6839                    
    6840                            .dwattr $C$DW$T$53, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_soc
    6841                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x125)
    6842                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x01)
    6843                            .dwendtag $C$DW$T$53
    6844                    
    6845                    $C$DW$T$464     .dwtag  DW_TAG_typedef
    6846                            .dwattr $C$DW$T$464, DW_AT_name("SlSockEvent_t")
    6847                            .dwattr $C$DW$T$464, DW_AT_type(*$C$DW$T$53)
    6848                            .dwattr $C$DW$T$464, DW_AT_language(DW_LANG_C)
    6849                            .dwattr $C$DW$T$464, DW_AT_decl_file("/vagrant/Q4_04/sdk_root/source/ti/drivers/net/wifi/sl_so
    6850                            .dwattr $C$DW$T$464, DW_AT_decl_line(0x128)
    6851                            .dwattr $C$DW$T$464, DW_AT_decl_column(0x03)
    6852                    
    6853                    
    6854                    $C$DW$T$54      .dwtag  DW_TAG_structure_type
