/*
 * Copyright (C) 2017 C-SKY Microsystems Co., Ltd. All rights reserved.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */
/******************************************************************************
 * @file     zx29_rtc.h
 * @brief    header file for rtc driver
 * @version  V1.0
 * @date     01. November 2017
 ******************************************************************************/

#ifndef _ZX29_RTC_H_
#define _ZX29_RTC_H_

/****************************************************************************
* 	                        Include files
****************************************************************************/
#include <soc.h>

/*******************************************************************************
 *                             Type definitions                                *
 ******************************************************************************/
enum e_model_12_24 {
    MODEL_24  = 0x0,    /* 0:24h model */

#define TIMSTAP1_TIME_NEG_PMAM			TIMSTAP1_TIME_NEG_PMAM
#define TIMSTAP1_TIME_NEG_PMAM_SHIFT	(23)
#define TIMSTAP1_TIME_NEG_PMAM_MASK		(BIT_MASK(1) << TIMSTAP1_TIME_NEG_PMAM_SHIFT)

/* TIMSTAP1_DAY_NEG*/
/* TIMSTAP1_DAY_NEG_WEEK, */
#define TIMSTAP1_DAY_NEG_WEEK			TIMSTAP1_DAY_NEG_WEEK
#define TIMSTAP1_DAY_NEG_WEEK_SHIFT		(0)
#define TIMSTAP1_DAY_NEG_WEEK_MASK		(BIT_MASK(3) << TIMSTAP1_DAY_NEG_WEEK_SHIFT)

/* TIMSTAP1_DAY_NEG_DAY, R */
#define TIMSTAP1_DAY_NEG_DAY			TIMSTAP1_DAY_NEG_DAY
#define TIMSTAP1_DAY_NEG_DAY_SHIFT		(3)
#define TIMSTAP1_DAY_NEG_DAY_MASK		(BIT_MASK(6) << TIMSTAP1_DAY_NEG_DAY_SHIFT)

/* TIMSTAP1_DAY_NEG_DAY0, R */
#define TIMSTAP1_DAY_NEG_DAY0			TIMSTAP1_DAY_NEG_DAY0
#define TIMSTAP1_DAY_NEG_DAY0_SHIFT		(3)
#define TIMSTAP1_DAY_NEG_DAY0_MASK		(BIT_MASK(4) << TIMSTAP1_DAY_NEG_DAY0_SHIFT)

/* TIMSTAP1_DAY_NEG_DAY1, R */
#define TIMSTAP1_DAY_NEG_DAY1			TIMSTAP1_DAY_NEG_DAY1
#define TIMSTAP1_DAY_NEG_DAY1_SHIFT		(7)
#define TIMSTAP1_DAY_NEG_DAY1_MASK		(BIT_MASK(2) << TIMSTAP1_DAY_NEG_DAY1_SHIFT)

/* TIMSTAP1_DAY_NEG_MONTH, R */
#define TIMSTAP1_DAY_NEG_MONTH			TIMSTAP1_DAY_NEG_MONTH
#define TIMSTAP1_DAY_NEG_MONTH_SHIFT	(9)
#define TIMSTAP1_DAY_NEG_MONTH_MASK		(BIT_MASK(5) << TIMSTAP1_DAY_NEG_MONTH_SHIFT)

/* TIMSTAP1_DAY_NEG_MONTH0, R */
#define TIMSTAP1_DAY_NEG_MONTH0			TIMSTAP1_DAY_NEG_MONTH0
#define TIMSTAP1_DAY_NEG_MONTH0_SHIFT	(9)
#define TIMSTAP1_DAY_NEG_MONTH0_MASK	(BIT_MASK(4) << TIMSTAP1_DAY_NEG_MONTH0_SHIFT)

/* TIMSTAP1_DAY_NEG_MONTH1, R */
#define TIMSTAP1_DAY_NEG_MONTH1			TIMSTAP1_DAY_NEG_MONTH1
#define TIMSTAP1_DAY_NEG_MONTH1_SHIFT	(13)
#define TIMSTAP1_DAY_NEG_MONTH1_MASK	(BIT_MASK(1) << TIMSTAP1_DAY_NEG_MONTH1_SHIFT)

/* TIMSTAP1_DAY_NEG_YEAR,  R */
#define TIMSTAP1_DAY_NEG_YEAR			TIMSTAP1_DAY_NEG_YEAR
#define TIMSTAP1_DAY_NEG_YEAR_SHIFT		(16)
#define TIMSTAP1_DAY_NEG_YEAR_MASK		(BIT_MASK(16) << TIMSTAP1_DAY_NEG_YEAR_SHIFT)

/* TIMSTAP1_DAY_NEG_YEAR0, R */
#define TIMSTAP1_DAY_NEG_YEAR0			TIMSTAP1_DAY_NEG_YEAR0
#define TIMSTAP1_DAY_NEG_YEAR0_SHIFT	(16)
#define TIMSTAP1_DAY_NEG_YEAR0_MASK		(BIT_MASK(4) << TIMSTAP1_DAY_NEG_YEAR0_SHIFT)

/* TIMSTAP1_DAY_NEG_YEAR1, R */
#define TIMSTAP1_DAY_NEG_YEAR1			TIMSTAP1_DAY_NEG_YEAR1
#define TIMSTAP1_DAY_NEG_YEAR1_SHIFT	(20)
#define TIMSTAP1_DAY_NEG_YEAR1_MASK		(BIT_MASK(4) << TIMSTAP1_DAY_NEG_YEAR1_SHIFT)

/* TIMSTAP1_DAY_NEG_YEAR2, R */
#define TIMSTAP1_DAY_NEG_YEAR2			TIMSTAP1_DAY_NEG_YEAR2
#define TIMSTAP1_DAY_NEG_YEAR2_SHIFT	(24)
#define TIMSTAP1_DAY_NEG_YEAR2_MASK		(BIT_MASK(4) << TIMSTAP1_DAY_NEG_YEAR2_SHIFT)

/* TIMSTAP1_DAY_NEG_YEAR3, R */
#define TIMSTAP1_DAY_NEG_YEAR3			TIMSTAP1_DAY_NEG_YEAR3
#define TIMSTAP1_DAY_NEG_YEAR3_SHIFT	(28)
#define TIMSTAP1_DAY_NEG_YEAR3_MASK		(BIT_MASK(4) << TIMSTAP1_DAY_NEG_YEAR3_SHIFT)

/*******************************************************************************
 *                             Type definitions                                *
 ******************************************************************************/
/** regs of RTC  */
typedef struct {
	uint32_t vers;                             /**< offset:0x00    R      */
	uint32_t sec;                              /**< offset:0x04    RW     */
	uint32_t min;                              /**< offset:0x08    RW     */
	uint32_t hour;                             /**< offset:0x0c    RW     */
	uint32_t day;                              /**< offset:0x10    RW     */
	uint32_t month;                            /**< offset:0x14    RW     */
	uint32_t year;                             /**< offset:0x18    RW     */
	uint32_t week;                             /**< offset:0x1c    RW     */
	uint32_t alarm_sec;                        /**< offset:0x20    RW     */
	uint32_t alarm_min;                        /**< offset:0x24    RW     */
	uint32_t alarm_hour;                       /**< offset:0x28    RW     */
	uint32_t alarm_day;                        /**< offset:0x2c    RW     */
	uint32_t alarm_month;                      /**< offset:0x30    RW     */
	uint32_t alarm_year;                       /**< offset:0x34    RW     */
	uint32_t rtc_control;                      /**< offset:0x38    RW     */
	uint32_t rtc_status;                       /**< offset:0x3c    R      */
	uint32_t rtc_int;                          /**< offset:0x40    RW     */
	uint32_t rtc_comp;                         /**< offset:0x44    RW     */
	uint32_t conf_id;                          /**< offset:0x48    RW     */
	uint32_t power_init1;                      /**< offset:0x4c    RW     */
	uint32_t power_init2;                      /**< offset:0x50    RW     */
	uint32_t rtc_get_time;                     /**< offset:0x54    RW     */
	uint32_t reserved;	 		   /**< offset:0x58    RW     */
	uint32_t stap_control; 			   /**< offset:0x5c    RW     */
	uint32_t stap0_time_pos;                   /**< offset:0x60    RW     */
	uint32_t stap0_day_pos;                    /**< offset:0x64    RW     */
	uint32_t stap0_time_neg;                   /**< offset:0x68    RW     */
	uint32_t stap0_day_neg;                    /**< offset:0x6c    RW     */
	uint32_t stap1_time_pos;                   /**< offset:0x70    RW     */
	uint32_t stap1_day_pos;                    /**< offset:0x74    RW     */
	uint32_t stap1_time_neg;                   /**< offset:0x78    RW     */
	uint32_t stap1_day_neg;                    /**< offset:0x7c    RW     */
} zx29_rtc_reg_t;

#endif
